{"spdx":0,"license":1,"identifier":2,"apache":3,"filecopyrighttext":4,"copyright":5,"contributors":6,"vllm":7,"project":8,"import":9,"importlib":10,"traceback":11,"from":12,"typing":13,"callable":14,"unittest":15,"mock":16,"patch":17,"def":18,"find_cuda_init":19,"fn":20,"object":21,"none":22,"helper":23,"function":24,"debug":25,"cuda":26,"re":27,"initialization":28,"errors":29,"initializes":30,"prints":31,"stack":32,"trace":33,"how":34,"happens":35,"torch":36,"_lazy_init":37,"wrapper":38,"nonlocal":39,"extract_stack":40,"return":41,"print":42,"initialized":43,"join":44,"format_list":45,"strip":46,"__name__":47,"__main__":48,"lambda":49,"import_module":50,"model_executor":51,"models":52,"llava":53,"ctypes":54,"util":55,"json":56,"logging":57,"os":58,"shutil":59,"subprocess":60,"sys":61,"pathlib":62,"path":63,"which":64,"packaging":65,"version":66,"parse":67,"setuptools":68,"extension":69,"setup":70,"command":71,"build_ext":72,"setuptools_scm":73,"get_version":74,"utils":75,"cpp_extension":76,"cuda_home":77,"rocm_home":78,"load_module_from_path":79,"module_name":80,"spec":81,"spec_from_file_location":82,"module":83,"module_from_spec":84,"modules":85,"loader":86,"exec_module":87,"root_dir":88,"__file__":89,"parent":90,"logger":91,"getlogger":92,"cannot":93,"envs":94,"directly":95,"because":96,"depends":97,"installed":98,"yet":99,"py":100,"vllm_target_device":101,"platform":102,"startswith":103,"darwin":104,"cpu":105,"warning":106,"automatically":107,"set":108,"due":109,"macos":110,"elif":111,"linux":112,"only":113,"supports":114,"including":115,"wsl":116,"building":117,"so":118,"may":119,"able":120,"run":121,"correctly":122,"empty":123,"getenv":124,"hip":125,"available":126,"fallback":127,"main_cuda_version":128,"12":129,"is_sccache_available":130,"bool":131,"sccache":132,"int":133,"vllm_disable_sccache":134,"is_ccache_available":135,"ccache":136,"is_ninja_available":137,"ninja":138,"is_url_available":139,"url":140,"str":141,"urllib":142,"request":143,"urlopen":144,"status":145,"try":146,"except":147,"exception":148,"false":149,"200":150,"class":151,"cmakeextension":152,"__init__":153,"self":154,"name":155,"cmake_lists_dir":156,"kwa":157,"super":158,"sources":159,"py_limited_api":160,"true":161,"abspath":162,"cmake_build_ext":163,"dict":164,"directories":165,"have":166,"been":167,"configured":168,"did_config":169,"determine":170,"number":171,"compilation":172,"jobs":173,"optionally":174,"nvcc":175,"compile":176,"threads":177,"compute_num_jobs":178,"num_jobs":179,"either":180,"value":181,"max_jobs":182,"environment":183,"variable":184,"defined":185,"cpus":186,"info":187,"using":188,"else":189,"sched_getaffinity":190,"isn":191,"universally":192,"fall":193,"back":194,"cpu_count":195,"we":196,"get":197,"error":198,"here":199,"len":200,"attributeerror":201,"nvcc_threads":202,"_is_cuda":203,"get_nvcc_cuda_version":204,"11":205,"when":206,"reduce":207,"avoid":208,"overloading":209,"system":210,"max":211,"perform":212,"cmake":213,"configuration":214,"single":215,"configure":216,"ext":217,"ve":218,"already":219,"cmakelists":220,"txt":221,"exit":222,"early":223,"select":224,"build":225,"type":226,"note":227,"optimization":228,"level":229,"default_cfg":230,"relwithdebinfo":231,"cfg":232,"cmake_build_type":233,"cmake_args":234,"dcmake_build_type":235,"format":236,"dvllm_target_device":237,"verbose":238,"dcmake_verbose_makefile":239,"dcmake_c_compiler_launcher":240,"dcmake_cxx_compiler_launcher":241,"dcmake_cuda_compiler_launcher":242,"dcmake_hip_compiler_launcher":243,"pass":244,"python":245,"executable":246,"can":247,"find":248,"exact":249,"match":250,"dvllm_python_executable":251,"reuse":252,"dependencies":253,"subsequent":254,"calls":255,"dvllm_python_path":256,"override":257,"base":258,"directory":259,"fetchcontent":260,"downloads":261,"root":262,"deps":263,"allows":264,"sharing":265,"between":266,"profiles":267,"plays":268,"more":269,"nicely":270,"fetchcontent_base_dir":271,"fc_base_dir":272,"environ":273,"dfetchcontent_base_dir":274,"parallelism":275,"tool":276,"num_job":277,"dnvcc_threads":278,"build_tool":279,"dcmake_job_pool_compile":280,"string":281,"dcmake_job_pools":282,"default":283,"whatever":284,"picks":285,"make":286,"sure":287,"use":288,"dcmake_cuda_compiler":289,"bin":290,"check_call":291,"cwd":292,"build_temp":293,"build_extensions":294,"ensure":295,"present":296,"working":297,"check_output":298,"oserror":299,"raise":300,"runtimeerror":301,"create":302,"does":303,"exist":304,"exists":305,"makedirs":306,"targets":307,"target_name":308,"removeprefix":309,"vllm_flash_attn":310,"all":311,"extensions":312,"append":313,"build_args":314,"target":315,"install":316,"libraries":317,"proper":318,"location":319,"outdir":320,"get_ext_fullpath":321,"absolute":322,"skip":323,"directo":324,"ry":325,"same":326,"continue":327,"appends":328,"prefix":329,"contains":330,"need":331,"remove":332,"range":333,"count":334,"should":335,"actually":336,"components":337,"install_args":338,"component":339,"first":340,"standard":341,"copy":342,"build_lib":343,"current":344,"included":345,"editable":346,"glob":347,"files":348,"recursive":349,"file":350,"dst_file":351,"split":352,"copying":353,"dirname":354,"exist_ok":355,"copy_file":356,"precompiled_build_ext":357,"disables":358,"precompiled":359,"binaries":360,"assert":361,"vllm_use_precompiled":362,"supported":363,"builds":364,"skipping":365,"precompiled_wheel_utils":366,"extracts":367,"other":368,"existing":369,"wheel":370,"staticmethod":371,"extract_precompiled_and_patch_package":372,"wheel_url_or_path":373,"tempfile":374,"zipfile":375,"temp_dir":376,"isfile":377,"wheel_filename":378,"mkdtemp":379,"wheels":380,"wheel_path":381,"downloading":382,"urlretrieve":383,"filename":384,"package_data_patch":385,"files_to_copy":386,"_c":387,"abi3":388,"_moe_c":389,"_flashmla_c":390,"_vllm_fa2_c":391,"_vllm_fa3_c":392,"cumem_allocator":393,"compiled_regex":394,"file_members":395,"list":396,"filter":397,"filelist":398,"extract":399,"target_path":400,"target_pa":401,"th":402,"open":403,"src":404,"wb":405,"dst":406,"copyfileobj":407,"pkg":408,"replace":409,"setdefault":410,"basename":411,"finally":412,"removing":413,"temporary":414,"rmtree":415,"get_base_commit_in_main_branch":416,"force":417,"nightly":418,"mainly":419,"used":420,"ci":421,"testing":422,"vllm_test_use_precompiled_nightly_wheel":423,"latest":424,"commit":425,"hash":426,"upstream":427,"main":428,"branch":429,"resp_json":430,"curl":431,"https":432,"api":433,"github":434,"com":435,"repos":436,"commits":437,"decode":438,"utf":439,"upstream_main_commit":440,"loads":441,"sha":442,"docker":443,"context":444,"git":445,"immutable":446,"missing":447,"vllm_docker_build_context":448,"check":449,"local":450,"repo":451,"cat":452,"calledprocesserror":453,"fetch":454,"remote":455,"repository":456,"update":457,"any":458,"branches":459,"ensures":460,"ref":461,"its":462,"history":463,"our":464,"current_branch":465,"show":466,"base_commit":467,"merge":468,"valueerror":469,"err":470,"failed":471,"compatible":472,"your":473,"dev":474,"_no_device":475,"has_cuda":476,"_is_neuron":477,"_is_tpu":478,"_is_hip":479,"rocm":480,"neuron":481,"tpu":482,"_is_cpu":483,"_is_xpu":484,"xpu":485,"_build_custom_ops":486,"get_rocm_version":487,"librocm":488,"core":489,"see":490,"blob":491,"d11f5c20d500f729c393680a01fa902ebf92094b":492,"rocm_version":493,"cpp":494,"l21":495,"librocm_core_file":496,"lib":497,"is_file":498,"librocm_core":499,"cdll":500,"vererrors":501,"c_uint32":502,"get_rocm_core_version":503,"getrocmversion":504,"restype":505,"argtypes":506,"pointer":507,"major":508,"minor":509,"byref":510,"get_neuronxcc_version":511,"sysconfig":512,"site_dir":513,"get_paths":514,"purelib":515,"version_file":516,"neuronxcc":517,"executed":518,"successfully":519,"fp":520,"content":521,"read":522,"regular":523,"expression":524,"search":525,"__version__":526,"group":527,"could":528,"output":529,"adapted":530,"nvidia":531,"apex":532,"8b7a1ff183741dd8f9b87e7bafd04cfde99cea28":533,"nvcc_output":534,"universal_newlines":535,"release_idx":536,"index":537,"release":538,"nvcc_cuda_version":539,"get_gaudi_sw_version":540,"returns":541,"driver":542,"enable":543,"console":544,"printing":545,"hl":546,"smi":547,"shell":548,"text":549,"capture_output":550,"env":551,"enable_console":552,"returncode":553,"stdout":554,"get_vllm_version":555,"write_to":556,"_version":557,"sep":558,"versions":559,"might":560,"contain":561,"cuda_version":562,"cuda_version_str":563,"source":564,"tarball":565,"required":566,"pypi":567,"sdist":568,"argv":569,"cu":570,"neuron_version":571,"neuron_version_str":572,"unknown":573,"runtime":574,"get_requirements":575,"package":576,"requirements":577,"requirements_dir":578,"_read_requirements":579,"resolved_requirements":580,"line":581,"common":582,"cuda_major":583,"cuda_minor":584,"modified_requirements":585,"req":586,"flash":587,"attn":588,"built":589,"unsupported":590,"please":591,"ext_modules":592,"_rocm_c":593,"fa3":594,"requires":595,"later":596,"optional":597,"since":598,"doesn":599,"produce":600,"targeting":601,"hopper":602,"package_data":603,"typed":604,"layers":605,"fused_moe":606,"configs":607,"quantization":608,"advance":609,"wheel_location":610,"vllm_precompiled_wheel_location":611,"wheel_url":612,"ai":613,"cp38":614,"manylinux1_x86_64":615,"whl":616,"resp":617,"warn":618,"falling":619,"items":620,"extend":621,"_no_":622,"device":623,"cmdclass":624,"static":625,"metadata":626,"rather":627,"go":628,"pyproject":629,"toml":630,"install_requires":631,"extras_require":632,"bench":633,"pandas":634,"datasets":635,"tensorizer":636,"10":637,"fastsafetensors":638,"runai":639,"model":640,"streamer":641,"13":642,"s3":643,"boto3":644,"audio":645,"librosa":646,"soundfile":647,"mistral_common":648,"processing":649,"video":650,"kept":651,"backwards":652,"compatibility":653,"flashinfer":654,"updated":655,"together":656,"dockerfile":657,"requires_files":658,"cleaning":659,"lines":660,"readlines":661,"lower":662,"removed":663,"write":664,"done":665,"vllm_max_size_mb":666,"defaulting":667,"400":668,"mib":669,"quota":670,"wisely":671,"support":672,"issues":673,"3792":674,"also":675,"sync":676,"one":677,"print_top_10_largest_files":678,"zip_file":679,"top":680,"largest":681,"given":682,"zip":683,"file_sizes":684,"getinfo":685,"file_size":686,"namelist":687,"sort":688,"key":689,"reverse":690,"size":691,"1024":692,"2f":693,"mbs":694,"uncompressed":695,"check_wheel_size":696,"walk":697,"file_name":698,"endswith":699,"wheel_size_mb":700,"getsize":701,"allowed":702,"larger":703,"mb":704,"than":705,"limit":706,"within":707,"usage":708,"argparse":709,"template":710,"doctype":711,"html":712,"body":713,"h1":714,"links":715,"href":716,"wheel_html_escaped":717,"br":718,"parser":719,"argumentparser":720,"add_argument":721,"help":722,"args":723,"parse_args":724,"generated":725,"cloudfront":726,"escaping":727,"character":728,"2b":729,"io":730,"time":731,"dataclasses":732,"dataclass":733,"field":734,"union":735,"aiohttp":736,"huggingface_hub":737,"constants":738,"tqdm":739,"asyncio":740,"transformers":741,"autotokenizer":742,"pretrainedtokenizer":743,"pretrainedtokenizerfast":744,"simon":745,"do":746,"benchmark":747,"script":748,"without":749,"aiohttp_timeout":750,"clienttimeout":751,"total":752,"60":753,"requestfuncinput":754,"prompt":755,"api_url":756,"prompt_len":757,"output_len":758,"model_name":759,"logprobs":760,"extra_body":761,"multi_modal_content":762,"ignore_eos":763,"language":764,"requestfuncoutput":765,"generated_text":766,"success":767,"latency":768,"float":769,"output_tokens":770,"ttft":771,"token":772,"itl":773,"default_factory":774,"inter":775,"latencies":776,"tpot":777,"avg":778,"next":779,"async":780,"async_request_tgi":781,"request_func_input":782,"pbar":783,"generate_stream":784,"clientsession":785,"trust_env":786,"timeout":787,"session":788,"params":789,"max_new_tokens":790,"do_sample":791,"temperature":792,"01":793,"tgi":794,"accept":795,"top_p":796,"99":797,"truncate":798,"ignore_eos_token":799,"payload":800,"inputs":801,"parameters":802,"st":803,"perf_counter":804,"most_recent_timestamp":805,"post":806,"response":807,"chunk_bytes":808,"sometimes":809,"ping":810,"data":811,"chunk":812,"timestamp":813,"decoding":814,"phase":815,"reason":816,"exc_info":817,"format_exception":818,"async_request_trt_llm":819,"accumulate_tokens":820,"text_input":821,"max_tokens":822,"stream":823,"min_length":824,"prompt_l":825,"en":826,"text_output":827,"async_request_deepspeed_mii":828,"completions":829,"profile":830,"openai":831,"must":832,"end":833,"deepspeed":834,"mii":835,"temp":836,"headers":837,"authorization":838,"bearer":839,"openai_api_key":840,"streaming":841,"jan":842,"28":843,"2024":844,"placeholder":845,"microsoft":846,"pull":847,"311":848,"parsed_resp":849,"await":850,"choices":851,"unexpected":852,"neither":853,"nor":854,"found":855,"async_request_openai_completions":856,"requestfuncin":857,"put":858,"repetition_penalty":859,"stream_options":860,"include_usage":861,"first_chunk_received":862,"me":863,"completion":864,"last":865,"summary":866,"want":867,"special":868,"tokens":869,"completion_tokens":870,"never":871,"received":872,"valid":873,"calculate":874,"marked":875,"async_request_openai_chat_completions":876,"chat":877,"mm_content":878,"isinstance":879,"typeerror":880,"messages":881,"role":882,"user":883,"max_completion_tokens":884,"application":885,"gene":886,"rated_text":887,"sse":888,"comments":889,"often":890,"pings":891,"start":892,"colon":893,"skipped":894,"delta":895,"async_request_openai_audio":896,"lazy":897,"placeholdermodule":898,"dep":899,"transcriptions":900,"translations":901,"flattened":902,"multipart":903,"form":904,"stream_include_usage":905,"stream_continuous_usage_stats":906,"send":907,"to_bytes":908,"sr":909,"buffer":910,"bytesio":911,"wav":912,"seek":913,"mm_audio":914,"typeerro":915,"containing":916,"formdata":917,"add_field":918,"content_type":919,"get_model":920,"pretrained_model_name_or_path":921,"vllm_use_modelscope":922,"modelscope":923,"snapshot_download":924,"model_loader":925,"weight_utils":926,"get_lock":927,"lock":928,"prevent":929,"multiple":930,"processes":931,"weights":932,"model_path":933,"model_id":934,"local_files_only":935,"hf_hub_offline":936,"ignore_file_pattern":937,"pt":938,"safetensors":939,"get_tokenizer":940,"tokenizer_mode":941,"auto":942,"trust_remote_code":943,"kwargs":944,"slow":945,"use_fast":946,"fast":947,"tokenizer":948,"mode":949,"mistral":950,"transformers_utils":951,"mistraltokenizer":952,"importerror":953,"pip":954,"from_pretrained":955,"async_request_funcs":956,"lmdeploy":957,"tensorrt":958,"llm":959,"scalellm":960,"sglang":961,"llama":962,"openai_compatible_backends":963,"gc":964,"tabulate":965,"benchmark_utils":966,"timecollector":967,"flexibleargumentparser":968,"v1":969,"block_pool":970,"blockpool":971,"rows":972,"allocate_block":973,"allocate_blocks":974,"enforce":975,"collect":976,"ahead":977,"minimize":978,"impact":979,"among":980,"runs":981,"num_gpu_blocks":982,"enable_caching":983,"get_blocks_times":984,"us":985,"free_blocks_times":986,"num_iteration":987,"blocks":988,"get_new_blocks":989,"free_blocks":990,"cnt":991,"dump_avg_max":992,"iterations":993,"nblocks":994,"allocated":995,"navg":996,"nmax":997,"free":998,"tablefmt":999,"grid":1000,"floatfmt":1001,"3f":1002,"invoke_main":1003,"description":1004,"performance":1005,"kv":1006,"cache":1007,"num":1008,"gpu":1009,"100000":1010,"iteration":1011,"1000":1012,"stablize":1013,"final":1014,"readings":1015,"allocate":1016,"nargs":1017,"50":1018,"100":1019,"500":1020,"pragma":1021,"cover":1022,"defines":1023,"framework":1024,"sampling":1025,"requests":1026,"various":1027,"each":1028,"dataset":1029,"subclass":1030,"benchmarkdataset":1031,"implement":1032,"sample":1033,"generation":1034,"types":1035,"include":1036,"sharegpt":1037,"random":1038,"synthetic":1039,"sonnet":1040,"burstgpt":1041,"huggingface":1042,"visionarena":1043,"base64":1044,"abc":1045,"abstractmethod":1046,"collections":1047,"mapping":1048,"functools":1049,"numpy":1050,"np":1051,"pd":1052,"load_dataset":1053,"pil":1054,"image":1055,"pretrainedtokenizerbase":1056,"lora":1057,"lorarequest":1058,"get_adapter_absolute_path":1059,"multimodal":1060,"multimodaldatadict":1061,"convert_image_mode":1062,"anytokenizer":1063,"get_lora_tokenizer":1064,"classes":1065,"samplerequest":1066,"represents":1067,"inference":1068,"benchmarking":1069,"expected_output_len":1070,"multi_modal_data":1071,"lora_request":1072,"default_seed":1073,"is_multimodal":1074,"dataset_path":1075,"random_seed":1076,"initialize":1077,"seed":1078,"indicates":1079,"reproducible":1080,"shuffling":1081,"defaults":1082,"ensuring":1083,"replaced":1084,"apply_multimodal_chat_transformation":1085,"transform":1086,"method":1087,"expect":1088,"specific":1089,"conversation":1090,"load_data":1091,"load":1092,"overridden":1093,"subclasses":1094,"vary":1095,"depending":1096,"raises":1097,"notimplementederror":1098,"todo":1099,"jenniferzhao":1100,"add":1101,"implemented":1102,"get_random_lora_request":1103,"max_loras":1104,"option":1105,"al":1106,"lora_path":1107,"tuple":1108,"associated":1109,"provided":1110,"randomly":1111,"selects":1112,"based":1113,"retrieves":1114,"cached":1115,"otherwise":1116,"selected":1117,"maximum":1118,"loras":1119,"disk":1120,"where":1121,"element":1122,"applicable":1123,"second":1124,"generate":1125,"id":1126,"lora_id":1127,"randint":1128,"lora_name":1129,"lora_int_id":1130,"lora_path_on_disk":1131,"lora_tokenizer_cache":1132,"num_requests":1133,"abstract":1134,"subcl":1135,"asses":1136,"logic":1137,"generating":1138,"objects":1139,"maybe_oversample_requests":1140,"oversamples":1141,"less":1142,"desired":1143,"sampled":1144,"additional":1145,"oversampled":1146,"reach":1147,"samples":1148,"utility":1149,"functions":1150,"global":1151,"caches":1152,"is_valid_sequence":1153,"min_len":1154,"max_prompt_len":1155,"max_total_len":1156,"2048":1157,"skip_min_output_len_check":1158,"validate":1159,"sequence":1160,"lengths":1161,"pruning":1162,"criteria":1163,"copied":1164,"original":1165,"sample_hf_requests":1166,"sample_sharegpt_requests":1167,"benchmark_serving":1168,"well":1169,"sample_requests":1170,"benchmark_throughput":1171,"invalid":1172,"conditions":1173,"prompt_too_short":1174,"output_too_short":1175,"prompt_too_long":1176,"combined_too_long":1177,"met":1178,"tokenizers":1179,"process_image":1180,"process":1181,"input":1182,"multimedia":1183,"dictionary":1184,"three":1185,"raw":1186,"bytes":1187,"expects":1188,"converts":1189,"rgb":1190,"saves":1191,"jpeg":1192,"memory":1193,"encodes":1194,"treats":1195,"prepends":1196,"http":1197,"image_data":1198,"save":1199,"image_base64":1200,"b64encode":1201,"getvalue":1202,"image_url":1203,"implementation":1204,"randomdataset":1205,"values":1206,"default_prefix_len":1207,"default_range_ratio":1208,"default_input_len":1209,"default_output_len":1210,"128":1211,"prefix_len":1212,"range_ratio":1213,"input_len":1214,"random_range_ratio":1215,"vocab_size":1216,"num_special_tokens":1217,"num_special_tokens_to_add":1218,"real_input_len":1219,"prefix_token_ids":1220,"tolist":1221,"new":1222,"input_low":1223,"input_high":1224,"output_low":1225,"bound":1226,"length":1227,"least":1228,"cause":1229,"failures":1230,"output_high":1231,"debugging":1232,"input_lens":1233,"output_lens":1234,"offsets":1235,"inner_seq":1236,"arange":1237,"token_sequence":1238,"after":1239,"encode":1240,"again":1241,"some":1242,"cases":1243,"consecutive":1244,"give":1245,"tokenized":1246,"example":1247,"gpt2tokenizer":1248,"6880":1249,"6881":1250,"ġcalls":1251,"1650":1252,"939":1253,"486":1254,"ġcall":1255,"sh":1256,"ere":1257,"uncontrolled":1258,"change":1259,"encoded":1260,"truncated":1261,"before":1262,"being":1263,"total_input_len":1264,"re_encoded_sequence":1265,"add_special_tokens":1266,"sharegptdataset":1267,"implements":1268,"generates":1269,"turns":1270,"loading":1271,"encoding":1272,"entries":1273,"two":1274,"entry":1275,"conversations":1276,"shuffle":1277,"enable_multimodal_chat":1278,"break":1279,"prompt_ids":1280,"input_ids":1281,"completion_ids":1282,"new_output_len":1283,"sharegpt4video":1284,"image_path":1285,"custom":1286,"customdataset":1287,"jsonl":1288,"what":1289,"capital":1290,"india":1291,"iran":1292,"china":1293,"dictionaries":1294,"standardized":1295,"has":1296,"convert":1297,"filetype":1298,"assume":1299,"jsonl_data":1300,"read_json":1301,"path_or_buf":1302,"column":1303,"columns":1304,"row":1305,"dataframe":1306,"corresponds":1307,"iterrows":1308,"to_dict":1309,"skip_chat_template":1310,"sampled_requests":1311,"item":1312,"apply":1313,"apply_chat_template":1314,"add_generation_prompt":1315,"tokenize":1316,"sonnetdataset":1317,"simplified":1318,"poem":1319,"550":1320,"150":1321,"return_prompt_formatted":1322,"average":1323,"tokenized_lines":1324,"avg_len":1325,"sum":1326,"base_prompt":1327,"pick":1328,"many":1329,"you":1330,"base_msg":1331,"base_fmt":1332,"base_offset":1333,"higher":1334,"num_input_lines":1335,"round":1336,"num_prefix_lines":1337,"prefix_lines":1338,"while":1339,"extra_lines":1340,"msg":1341,"prompt_formatted":1342,"burstgptdataset":1343,"csv":1344,"gpt":1345,"positive":1346,"df":1347,"read_csv":1348,"keep":1349,"gpt4_df":1350,"_sample_loaded_data":1351,"random_state":1352,"lists":1353,"lora_req":1354,"ist":1355,"ids":1356,"computed":1357,"modulo":1358,"token_ids":1359,"huggingfacedataset":1360,"hosted":1361,"supported_dataset_paths":1362,"dataset_split":1363,"no_stream":1364,"dataset_subset":1365,"load_stream":1366,"conversationdataset":1367,"lmms":1368,"lab":1369,"onevision":1370,"aeala":1371,"sharegpt_vicuna_unfiltered":1372,"examples":1373,"filtered_data":1374,"dynamic_output":1375,"conv":1376,"completion_len":1377,"enabled":1378,"longer":1379,"accurate":1380,"actual":1381,"vision":1382,"arena":1383,"visionarenadataset":1384,"lmarena":1385,"v0":1386,"parser_fn":1387,"images":1388,"instruct":1389,"coder":1390,"instructcoderdataset":1391,"instructcoder":1392,"co":1393,"likaixin":1394,"designed":1395,"general":1396,"code":1397,"editing":1398,"consists":1399,"114":1400,"239":1401,"instruction":1402,"triplets":1403,"covers":1404,"distinct":1405,"scenario":1406,"just":1407,"explanation":1408,"mt":1409,"mtbenchdataset":1410,"philschmid":1411,"turn":1412,"similar":1413,"9d98ab5ec":1414,"offline_inference":1415,"eagle":1416,"l14":1417,"l18":1418,"noqa":1419,"e501":1420,"256":1421,"sd":1422,"aimo":1423,"aimodataset":1424,"reasoning":1425,"questions":1426,"mo":1427,"validation":1428,"aime":1429,"numinamath":1430,"cot":1431,"problem":1432,"solution":1433,"32000":1434,"edit":1435,"prediction":1436,"zeta_prompt":1437,"assistant":1438,"task":1439,"analyze":1440,"edits":1441,"rewrite":1442,"excerpt":1443,"provides":1444,"suggesting":1445,"appropriate":1446,"edi":1447,"ts":1448,"taking":1449,"account":1450,"cursor":1451,"_format_zeta_prompt":1452,"original_start_marker":1453,"editable_region_start":1454,"zeta":1455,"nep":1456,"formats":1457,"prompts":1458,"expected":1459,"outputs":1460,"further":1461,"extended":1462,"events":1463,"marker":1464,"indicating":1465,"region":1466,"formatted":1467,"following":1468,"focused":1469,"output_start_index":1470,"output_focused_region":1471,"expected_output":1472,"nexteditpredictiondataset":1473,"zed":1474,"industries":1475,"mapping_prompt_funcs":1476,"formatting_prompt_func":1477,"asr":1478,"asrdataset":1479,"transcription":1480,"tested":1481,"domain":1482,"speaking":1483,"style":1484,"hf":1485,"subset":1486,"ted":1487,"lium":1488,"talks":1489,"oratory":1490,"release1":1491,"release2":1492,"release3":1493,"speaker":1494,"adaptation":1495,"voxpopuli":1496,"european":1497,"parliament":1498,"de":1499,"fr":1500,"librispeech":1501,"audiobook":1502,"narrated":1503,"tedlium":1504,"gigaspeech":1505,"podcast":1506,"youtube":1507,"spontaneous":1508,"xs":1509,"xl":1510,"test":1511,"spgispeech":1512,"financial":1513,"meetings":1514,"ami":1515,"ihm":1516,"sdm":1517,"openslr":1518,"librispeech_asr":1519,"facebook":1520,"edinburghcstr":1521,"speechcolab":1522,"kensho":1523,"whisper":1524,"interface":1525,"transcription_preamble":1526,"startoftranscript":1527,"transcribe":1528,"notimestamps":1529,"skip_long_audios":1530,"array":1531,"sampling_rate":1532,"duration_s":1533,"get_duration":1534,"duration":1535,"30":1536,"discarded":1537,"greater":1538,"batch":1539,"typing_extensions":1540,"deprecated":1541,"convert_to_pytorch_benchmark_format":1542,"write_to_json":1543,"samplingparams":1544,"engine":1545,"arg_utils":1546,"engineargs":1547,"prompttype":1548,"sampling_params":1549,"beamsearchparams":1550,"save_to_pytorch_benchmark_format":1551,"namespace":1552,"results":1553,"pt_records":1554,"metrics":1555,"extra_info":1556,"avg_latency":1557,"percentiles":1558,"pt_file":1559,"splitext":1560,"output_json":1561,"pytorch":1562,"benchmark_latency":1563,"future":1564,"instead":1565,"engine_args":1566,"from_cli_args":1567,"woosuk":1568,"processed":1569,"batches":1570,"asdict":1571,"llm_engine":1572,"model_config":1573,"max_model_len":1574,"detokenize":1575,"disable_detokenize":1576,"dummy_prompt_token_ids":1577,"10000":1578,"batch_size":1579,"dummy_prompts":1580,"prompt_token_ids":1581,"llm_generate":1582,"use_beam_search":1583,"use_tqdm":1584,"beam_search":1585,"beam_width":1586,"run_to_completion":1587,"profile_dir":1588,"start_profile":1589,"stop_profile":1590,"start_time":1591,"end_time":1592,"warming":1593,"up":1594,"num_iters_warmup":1595,"desc":1596,"warmup":1597,"vllm_torc":1598,"h_profiler_dir":1599,"profiling":1600,"saved":1601,"num_iters":1602,"percentages":1603,"25":1604,"75":1605,"90":1606,"percentile":1607,"mean":1608,"seconds":1609,"percentage":1610,"specified":1611,"dump":1612,"indent":1613,"create_argument_parser":1614,"till":1615,"32":1616,"sequences":1617,"per":1618,"beam":1619,"action":1620,"store_true":1621,"iters":1622,"disable":1623,"responses":1624,"detokenization":1625,"measurement":1626,"add_cli_args":1627,"enables":1628,"caching":1629,"skews":1630,"numbers":1631,"set_defaults":1632,"enable_prefix_caching":1633,"vllm_torch_profiler_dir":1634,"profiler":1635,"offline":1636,"long":1637,"document":1638,"qa":1639,"throughput":1640,"workload":1641,"different":1642,"20000":1643,"replicates":1644,"times":1645,"order":1646,"benchmark_long_document_qa_throughput":1647,"meta":1648,"7b":1649,"documents":1650,"repeat":1651,"commandline":1652,"arguments":1653,"modes":1654,"tile":1655,"entire":1656,"repeated":1657,"potentially":1658,"lowest":1659,"hit":1660,"interleave":1661,"consecutively":1662,"moving":1663,"highest":1664,"meantime":1665,"refer":1666,"details":1667,"test_long_document_qa":1668,"spent":1669,"parameter":1670,"strings":1671,"execute":1672,"4f":1673,"secs":1674,"repeat_prompts":1675,"repeat_count":1676,"repetition":1677,"repeated_prompts":1678,"shuffle_seed":1679,"prepare":1680,"beginning":1681,"hi":1682,"document_length":1683,"num_documents":1684,"repeat_mode":1685,"warmup_prompts":1686,"warm":1687,"automatic":1688,"roughly":1689,"paper":1690,"excluding":1691,"min":1692,"config":1693,"modelconfig":1694,"speculativeconfig":1695,"vllmconfig":1696,"spec_decode":1697,"ngram_proposer":1698,"ngramproposer":1699,"max_ngram":1700,"collector":1701,"opt":1702,"125m":1703,"num_token":1704,"num_spec_token":1705,"dtype":1706,"proposer":1707,"vllm_config":1708,"speculative_config":1709,"prompt_lookup_min":1710,"min_ngram":1711,"prompt_lookup_max":1712,"num_speculative_tokens":1713,"ngram":1714,"propose":1715,"20":1716,"num_req":1717,"gram":1718,"speculative":1719,"drafting":1720,"1500":1721,"minimum":1722,"15":1723,"efficiency":1724,"fixed":1725,"benchmark_prefix_caching":1726,"sharegpt_v3_unfiltered_cleaned_split":1727,"backend_request_func":1728,"helpful":1729,"recognizes":1730,"tables":1731,"markdown":1732,"table":1733,"fellows":1734,"answer":1735,"my":1736,"question":1737,"about":1738,"opening":1739,"sl":1740,"film":1741,"cast":1742,"director":1743,"music":1744,"notes":1745,"agni":1746,"pushpam":1747,"jayabharathi":1748,"kamalahasan":1749,"jeassy":1750,"arjunan":1751,"16":1752,"priyamvada":1753,"mohan":1754,"sharma":1755,"lakshmi":1756,"kpac":1757,"lalitha":1758,"sethumadhavan":1759,"dakshinamoorthy":1760,"23":1761,"yakshagaanam":1762,"madhu":1763,"sheela":1764,"viswanathan":1765,"paalkkada":1766,"sharada":1767,"prasad":1768,"ummer":1769,"amma":1770,"srividya":1771,"krishnan":1772,"nair":1773,"appooppan":1774,"thikkurissi":1775,"sukumaran":1776,"kamal":1777,"haasan":1778,"bhaskaran":1779,"baburaj":1780,"srishti":1781,"chowalloor":1782,"krishnankutty":1783,"ravi":1784,"alummoodu":1785,"muhammad":1786,"vanadevatha":1787,"prem":1788,"nazir":1789,"madhubala":1790,"yusufali":1791,"kechery":1792,"devarajan":1793,"27":1794,"samasya":1795,"kamalahaasan":1796,"thankappan":1797,"shyam":1798,"yudhabhoomi":1799,"vidhubala":1800,"crossbelt":1801,"mani":1802,"shekhar":1803,"seemantha":1804,"puthran":1805,"raj":1806,"swapnadanam":1807,"rani":1808,"chandra":1809,"dr":1810,"mohandas":1811,"george":1812,"bhaskar":1813,"chandavarkar":1814,"19":1815,"thulavarsham":1816,"sreedevi":1817,"sudheer":1818,"sankaran":1819,"14":1820,"aruthu":1821,"kaviyoor":1822,"ponnamma":1823,"26":1824,"swimming":1825,"pool":1826,"soman":1827,"sasikumar":1828,"nwhat":1829,"cells":1830,"test_prefix":1831,"cost":1832,"sample_tokens":1833,"vocab":1834,"get_vocab":1835,"all_special_ids":1836,"sample_requests_from_dataset":1837,"input_length_range":1838,"fixed_output_len":1839,"too":1840,"small":1841,"out":1842,"max_len":1843,"short":1844,"filtered_requests":1845,"completion_token_ids":1846,"sample_requests_from_random":1847,"unique_part_token_ids":1848,"repeat_and_sort_requests":1849,"repeated_requests":1850,"map":1851,"num_prompts":1852,"stats":1853,"prompt_lens":1854,"p50":1855,"sorted":1856,"filtered":1857,"test_":1858,"specifies":1859,"added":1860,"subtract":1861,"filtering":1862,"prioritization":1863,"equi":1864,"probable":1865,"priority":1866,"get_random_flag":1867,"filtered_dataset":1868,"prune":1869,"run_vllm":1870,"_priority":1871,"synthesize":1872,"backend":1873,"elapsed_time":1874,"total_num_tokens":1875,"requests_per_second":1876,"tokens_per_second":1877,"overrides":1878,"online":1879,"serving":1880,"server":1881,"side":1882,"commands":1883,"serve":1884,"your_model":1885,"swap":1886,"space":1887,"client":1888,"benchmarks":1889,"rate":1890,"request_rate":1891,"inf":1892,"endpoint":1893,"above":1894,"warnings":1895,"iterable":1896,"datetime":1897,"literal":1898,"benchmark_dataset":1899,"se":1900,"rve":1901,"get_request":1902,"milliseconds_to_seconds_conversion":1903,"benchmarkmetrics":1904,"completed":1905,"total_input":1906,"total_output":1907,"request_throughput":1908,"request_goodput":1909,"output_throughput":1910,"total_token_throughput":1911,"mean_ttft_ms":1912,"median_ttft_ms":1913,"std_ttft_ms":1914,"percentiles_ttft_ms":1915,"mean_tpot_ms":1916,"median_tpot_ms":1917,"std_tpot_ms":1918,"percentiles_tpot_ms":1919,"mean_itl_ms":1920,"median_itl_ms":1921,"std_itl_ms":1922,"percentiles_itl_ms":1923,"e2el":1924,"stands":1925,"taken":1926,"sending":1927,"receiving":1928,"complete":1929,"mean_e2el_ms":1930,"median_e2el_ms":1931,"std_e2el_ms":1932,"percentiles_e2el_ms":1933,"calculate_metrics":1934,"input_requests":1935,"dur_s":1936,"selected_percentile_metrics":1937,"selected_percentiles":1938,"goodput_config_dict":1939,"actual_output_lens":1940,"good_completed":1941,"itls":1942,"tpots":1943,"all_tpots":1944,"ttfts":1945,"e2els":1946,"backends":1947,"looking":1948,"bundled":1949,"inflate":1950,"slightly":1951,"latency_minus_ttft":1952,"regard":1953,"goodput":1954,"valid_metrics":1955,"slo_values":1956,"req_metric":1957,"is_good_req":1958,"likely":1959,"misconfiguration":1960,"stacklevel":1961,"std":1962,"median":1963,"base_url":1964,"burstiness":1965,"disable_tqdm":1966,"max_concurrency":1967,"lora_modules":1968,"ramp_up_strategy":1969,"linear":1970,"exponential":1971,"ramp_up_start_rps":1972,"ramp_up_end_rps":1973,"request_func":1974,"starting":1975,"initial":1976,"test_prompt":1977,"test_prompt_len":1978,"test_output_len":1979,"test_mm_content":1980,"ust":1981,"test_input":1982,"test_output":1983,"choose":1984,"iter":1985,"choice":1986,"profile_input":1987,"profile_output":1988,"started":1989,"distribution":1990,"poisson":1991,"gamma":1992,"traffic":1993,"ramp":1994,"strategy":1995,"increase":1996,"rps":1997,"over":1998,"factor":1999,"concurrency":2000,"once":2001,"simplify":2002,"limited_request_func":2003,"semaphore":2004,"contextlib":2005,"nullcontext":2006,"benchmark_start_time":2007,"tasks":2008,"rps_change_events":2009,"last_int_rps":2010,"now":2011,"isoformat":2012,"current_request_rate":2013,"current_int_rps":2014,"rps_val":2015,"req_model_id":2016,"req_model_name":2017,"req_lora_module":2018,"create_task":2019,"gather":2020,"close":2021,"benchmark_duration":2022,"result":2023,"40":2024,"successful":2025,"total_":2026,"tok":2027,"total_input_tokens":2028,"total_output_tokens":2029,"generated_texts":2030,"process_one_metric":2031,"metric_attribute_name":2032,"metric_name":2033,"metric_header":2034,"adds":2035,"statistics":2036,"metric":2037,"ms":2038,"getattr":2039,"mean_":2040,"_ms":2041,"median_":2042,"std_":2043,"percentiles_":2044,"p_word":2045,"excl":2046,"1st":2047,"stopping":2048,"stopped":2049,"check_goodput_args":2050,"valid_names":2051,"parse_goodput":2052,"slo_name":2053,"slo_val":2054,"service":2055,"objective":2056,"non":2057,"negative":2058,"slo_pairs":2059,"slo_pair":2060,"argumenttypeerror":2061,"objectives":2062,"specify":2063,"pairs":2064,"milliseconds":2065,"p99_ttft_ms":2066,"p99_tpot_ms":2067,"p99_itl_ms":2068,"useful":2069,"big":2070,"needed":2071,"ignored_metrics":2072,"don":2073,"suffix":2074,"served_model_name":2075,"tokenizer_id":2076,"controlled":2077,"argument":2078,"both":2079,"host":2080,"port":2081,"dataset_name":2082,"corresponding":2083,"ataset_name":2084,"custom_output_len":2085,"custom_skip_chat_template":2086,"formatting":2087,"sonnet_input_len":2088,"sonnet_output_len":2089,"sonnet_prefix_len":2090,"chat_template":2091,"default_chat_template":2092,"dataset_class":2093,"hf_split":2094,"train":2095,"hf_subset":2096,"dataset_c":2097,"lass":2098,"supported_datasets":2099,"cls":2100,"__subclasses__":2101,"consider":2102,"contributing":2103,"would":2104,"like":2105,"multi":2106,"modal":2107,"hf_output_len":2108,"follow":2109,"structure":2110,"dataset_mapping":2111,"sharegpt_output_len":2112,"random_prefix_len":2113,"random_input_len":2114,"random_output_len":2115,"keyerror":2116,"top_k":2117,"min_p":2118,"greedy":2119,"ackend":2120,"cache_prompt":2121,"pause":2122,"freeze":2123,"benchmark_result":2124,"percentile_metrics":2125,"metric_percentiles":2126,"save_result":2127,"append_result":2128,"result_json":2129,"current_dt":2130,"strftime":2131,"date":2132,"kvstring":2133,"valueer":2134,"ror":2135,"save_detailed":2136,"fields":2137,"points":2138,"del":2139,"base_model_id":2140,"max_concurrency_str":2141,"qps":2142,"result_filename":2143,"result_dir":2144,"outfile":2145,"newline":2146,"tell":2147,"keys":2148,"127":2149,"localhost":2150,"ipv4":2151,"8000":2152,"concurrent":2153,"simulate":2154,"enforcing":2155,"controls":2156,"initiated":2157,"control":2158,"means":2159,"combination":2160,"enough":2161,"compute":2162,"part":2163,"unspecified":2164,"disabled":2165,"dummy":2166,"logprob":2167,"returned":2168,"sent":2169,"arrival":2170,"take":2171,"effect":2172,"follows":2173,"intervals":2174,"bursty":2175,"uniform":2176,"arser":2177,"trust":2178,"progress":2179,"bar":2180,"launched":2181,"detailed":2182,"saving":2183,"whether":2184,"information":2185,"ttfs":2186,"etc":2187,"metavar":2188,"tp":2189,"record":2190,"keeping":2191,"purposes":2192,"dir":2193,"ignore":2194,"eos":2195,"flag":2196,"deepspeed_mii":2197,"comma":2198,"separated":2199,"report":2200,"percentils":2201,"names":2202,"spaces":2203,"definition":2204,"distserve":2205,"arxiv":2206,"org":2207,"pdf":2208,"2401":2209,"09670":2210,"blog":2211,"hao":2212,"blogs":2213,"custom_group":2214,"add_argument_group":2215,"options":2216,"applying":2217,"sonnet_group":2218,"sharegpt_group":2219,"random_group":2220,"ratio":2221,"define":2222,"symmetric":2223,"om":2224,"hf_group":2225,"sampling_group":2226,"always":2227,"preregistered":2228,"served":2229,"passed":2230,"launching":2231,"chooses":2232,"needs":2233,"ending":2234,"structured":2235,"benchmark_serving_structured_output":2236,"uuid":2237,"asyncgenerator":2238,"structured_output":2239,"backend_xgrammar":2240,"has_xgrammar_unsupported_json_features":2241,"representing":2242,"attributes":2243,"schema":2244,"structure_type":2245,"unique":2246,"json_schema_path":2247,"dir_path":2248,"realpath":2249,"structured_schemas":2250,"structured_schema_1":2251,"json_schemas":2252,"deepcopy":2253,"properties":2254,"__optional_field_":2255,"uuid4":2256,"schemas":2257,"gen_prompt":2258,"brief":2259,"dumps":2260,"get_schema":2261,"grammar":2262,"select_statement":2263,"condition":2264,"col_1":2265,"col_2":2266,"table_1":2267,"table_2":2268,"sql":2269,"query":2270,"username":2271,"email":2272,"users":2273,"regex":2274,"address":2275,"alan":2276,"turing":2277,"who":2278,"works":2279,"enigma":2280,"classify":2281,"sentiment":2282,"wonderful":2283,"datas":2284,"et":2285,"xgrammar_bench":2286,"nousresearch":2287,"eval":2288,"full_dataset_len":2289,"_filter_func":2290,"num_filtered_out":2291,"features":2292,"len_dataset":2293,"data_point_idx":2294,"idx":2295,"asynchronously":2296,"represented":2297,"takes":2298,"scale":2299,"theta":2300,"maintain":2301,"enumerate":2302,"yield":2303,"infinity":2304,"wait":2305,"interval":2306,"shape":2307,"sleep":2308,"mill":2309,"iseconds_to_seconds_conversion":2310,"centiles_itl_ms":2311,"structured_output_ratio":2312,"prepare_extra_body":2313,"structured_output_req_idx":2314,"test_request":2315,"test_req_extra_body":2316,"tes":2317,"t_input":2318,"input_":2319,"ttft_description":2320,"series":2321,"describe":2322,"tpot_description":2323,"ret":2324,"gt":2325,"evaluate":2326,"_eval_correctness_json":2327,"_eval_correctness_choice":2328,"_eval_correctness_regex":2329,"_eval_correctness":2330,"guided_json":2331,"guided_regex":2332,"guided_choice":2333,"scores":2334,"res":2335,"score":2336,"correctness":2337,"not_none_scores":2338,"guided_grammar":2339,"no_structured_output":2340,"save_results":2341,"result_file_name":2342,"guided":2343,"_out":2344,"correct_rate":2345,"he":2346,"lp":2347,"uvloop":2348,"automodelforcausallm":2349,"asyncengineargs":2350,"entrypoints":2351,"api_server":2352,"build_async_engine_client_from_engine_args":2353,"textprompt":2354,"tokensprompt":2355,"requestoutput":2356,"merge_async_iterators":2357,"lora_requests":2358,"enable_lora":2359,"beamsearch":2360,"run_vllm_chat":2361,"recommended":2362,"properly":2363,"handles":2364,"run_vllm_async":2365,"disable_frontend_multiprocessing":2366,"get_model_config":2367,"generators":2368,"sp":2369,"lr":2370,"generator":2371,"request_id":2372,"all_gens":2373,"run_hf":2374,"max_batch_size":2375,"torch_dtype":2376,"float16":2377,"model_type":2378,"padding":2379,"pad_token":2380,"eos_token":2381,"max_output_len":2382,"next_prompt_len":2383,"next_output_len":2384,"return_tensors":2385,"llm_outputs":2386,"num_return_sequences":2387,"use_cache":2388,"batch_decode":2389,"sk":2390,"ip_special_tokens":2391,"clear":2392,"run_mii":2393,"tensor_parallel_size":2394,"tensor_parallel":2395,"terminate_server":2396,"get_requests":2397,"common_kwargs":2398,"sample_kwargs":2399,"dataset_cls":2400,"hf_sub":2401,"is_multi_modal":2402,"request_outputs":2403,"async_engine":2404,"hf_max_batch_size":2405,"total_prompt_tokens":2406,"ro":2407,"033":2408,"91mwarning":2409,"0m":2410,"detected":2411,"counted":2412,"9778":2413,"counts":2414,"validate_args":2415,"deprecation":2416,"valid_backends":2417,"checks":2418,"ignored":2419,"vll":2420,"settings":2421,"validations":2422,"parallel":2423,"currently":2424,"16222":2425,"data_parallel_size":2426,"prompt_or_response":2427,"ync":2428,"frontend":2429,"multiprocessing":2430,"decoupled":2431,"adapters":2432,"relative":2433,"hugging":2434,"face":2435,"much":2436,"versus":2437,"remains":2438,"approximately":2439,"dtaset":2440,"math":2441,"tracebacktype":2442,"oss":2443,"wiki":2444,"integrate":2445,"database":2446,"records":2447,"benchmark_values":2448,"vars":2449,"infencoder":2450,"jsonencoder":2451,"clear_inf":2452,"isinf":2453,"iterencode":2454,"serializable":2455,"total_iteration":2456,"ns":2457,"_sum":2458,"_max":2459,"monotonic_ns":2460,"__enter__":2461,"__exit__":2462,"exc_type":2463,"baseexception":2464,"exc_value":2465,"exc_traceback":2466,"usr":2467,"python3":2468,"running":2469,"hipify":2470,"preprocessor":2471,"hipify_torch":2472,"hipify_python":2473,"live":2474,"project_dir":2475,"hipified":2476,"written":2477,"output_dir":2478,"scope":2479,"includes":2480,"extra_files":2481,"hold":2482,"copytree":2483,"dirs_exist_ok":2484,"hipify_result":2485,"project_directory":2486,"output_directory":2487,"header_include_dirs":2488,"show_detailed":2489,"is_pytorch_extension":2490,"hipify_extra_files_only":2491,"hipified_sources":2492,"s_abs":2493,"sour":2494,"ce":2495,"hipified_s_abs":2496,"hipified_path":2497,"cython":2498,"compiler":2499,"cythonize":2500,"annotate":2501,"infiles":2502,"detokenizer":2503,"output_processor":2504,"single_step":2505,"stop_checker":2506,"scheduler":2507,"block_manager":2508,"sampler":2509,"compiler_directives":2510,"language_level":2511,"infer_types":2512,"build_cython":2513,"inplace":2514,"enum":2515,"typeddict":2516,"typevar":2517,"pytest":2518,"nn":2519,"functional":2520,"autoconfig":2521,"batchencoding":2522,"batchfeature":2523,"auto_factory":2524,"_baseautomodelclass":2525,"tests":2526,"tokenstextlogprobs":2527,"tokenstextlogprobspromptlogprobs":2528,"assets":2529,"audioasset":2530,"imageasset":2531,"videoasset":2532,"convertoption":2533,"runneroption":2534,"_get_and_verify_dtype":2535,"connections":2536,"global_http_connection":2537,"distributed":2538,"cleanup_dist_env_and_memory":2539,"init_distributed_environment":2540,"initialize_model_parallel":2541,"explicitencoderdecoderprompt":2542,"to_enc_dec_tuple_list":2543,"zip_enc_dec_prompts":2544,"init_logger":2545,"maybe_model_redirect":2546,"_test_dir":2547,"_test_prompts":2548,"_long_prompts":2549,"_sys_msg":2550,"system_messages":2551,"sonnet3":2552,"5_nov2024":2553,"_m":2554,"_promptmultimodalinput":2555,"promptimageinput":2556,"promptaudioinput":2557,"ndarray":2558,"pr":2559,"omptvideoinput":2560,"_read_prompts":2561,"imageassetprompts":2562,"stop_sign":2563,"cherry_blossom":2564,"imagetestassets":2565,"convenience":2566,"matches":2567,"iterating":2568,"through":2569,"videoassetprompts":2570,"baby_reading":2571,"videotestassets":2572,"audioassetprompts":2573,"mary_had_lamb":2574,"winning_call":2575,"audiotestassets":2576,"image_assets":2577,"singleton":2578,"instance":2579,"video_assets":2580,"audio_assets":2581,"fixture":2582,"autouse":2583,"cleanup_vllm_use_v1":2584,"monkeypatch":2585,"oracle":2586,"sets":2587,"vllm_use_v1":2588,"during":2589,"invocation":2590,"touch":2591,"changes":2592,"made":2593,"cleaned":2594,"every":2595,"delete":2596,"clean":2597,"upon":2598,"modifies":2599,"setenv":2600,"delenv":2601,"run_with_both_engines":2602,"twice":2603,"use_v1":2604,"param":2605,"decorated":2606,"skip_v1":2607,"skip_v0":2608,"node":2609,"get_closest_marker":2610,"init_test_http_connection":2611,"pytest_asyncio":2612,"event":2613,"loop":2614,"created":2615,"anew":2616,"reuse_client":2617,"dist_init":2618,"temp_file":2619,"mkstemp":2620,"world_size":2621,"rank":2622,"distributed_init_method":2623,"local_rank":2624,"nccl":2625,"should_do_global_cleanup_after_test":2626,"allow":2627,"subdirectories":2628,"cleanup":2629,"overriding":2630,"provide":2631,"10x":2632,"speedup":2633,"unit":2634,"skip_global_cleanup":2635,"cleanup_fixture":2636,"dynamo_reset":2637,"_dynamo":2638,"reset":2639,"example_prompts":2640,"example_system_message":2641,"decoderprompttype":2642,"encoder":2643,"decoder":2644,"empty_str":2645,"example_encoder_decoder_prompts":2646,"wherein":2647,"pair":2648,"encoder_prompts":2649,"custom_decoder_prompts":2650,"empty_str_decoder_prompts":2651,"none_decoder_prompts":2652,"example_long_prompts":2653,"_t":2654,"tensor":2655,"_r":2656,"hfrunner":2657,"get_default_device":2658,"platforms":2659,"current_platform":2660,"is_cpu":2661,"device_type":2662,"wrap_device":2663,"hasattr":2664,"model_kwargs":2665,"is_sentence_transformer":2666,"is_cross_encoder":2667,"skip_tokenizer_init":2668,"auto_cls":2669,"is_pooling_model":2670,"init":2671,"amd":2672,"sentence_transformers":2673,"sentencetransformer":2674,"_remote_code":2675,"crossencoder":2676,"automodel_args":2677,"case":2678,"unquantized":2679,"quantization_method":2680,"bitsandbytes":2681,"call":2682,"device_count":2683,"autoprocessor":2684,"f401":2685,"processor":2686,"get_inputs":2687,"videos":2688,"promptvideoinput":2689,"audios":2690,"all_inputs":2691,"processor_kwargs":2692,"audio_inputs":2693,"hack":2694,"processors":2695,"get_prompt_embeddings":2696,"embeddings":2697,"embedding":2698,"get_input_embeddings":2699,"squeeze":2700,"logits":2701,"softmax":2702,"dim":2703,"output_ids":2704,"output_str":2705,"skip_special_tokens":2706,"clean_up_tokenization_spaces":2707,"generate_greedy":2708,"generate_beam_search":2709,"num_beams":2710,"pad_token_id":2711,"generate_greedy_logprobs":2712,"all_logprobs":2713,"output_hidden_states":2714,"return_dict_in_generate":2715,"seq_logprobs":2716,"_hidden_states_to_seq_logprobs":2717,"hidden_states":2718,"output_embeddings":2719,"get_output_embeddings":2720,"hidden_state":2721,"last_hidden_states":2722,"matmul":2723,"weight":2724,"bias":2725,"unsqueeze":2726,"log_softmax":2727,"float32":2728,"_hidden_states_to_logprobs":2729,"num_logprobs":2730,"seq_logprobs_lst":2731,"tok_idx":2732,"tok_logprobs":2733,"drop":2734,"reshape":2735,"topk":2736,"tok_logprobs_dct":2737,"token_id":2738,"indices":2739,"_lst":2740,"generate_greedy_logprobs_limit":2741,"all_output_ids":2742,"all_output_strs":2743,"seq_ids":2744,"output_logprobs":2745,"generate_encoder_decoder_greedy_logprobs_limit":2746,"encoder_decoder_prompts":2747,"expliciten":2748,"coderdecoderprompt":2749,"encoder_prompt":2750,"decoder_prompt":2751,"encoder_inputs":2752,"decoder_input_ids":2753,"decoder_inputs":2754,"decoder_hidden_states":2755,"predict":2756,"convert_to_tensor":2757,"hf_runner":2758,"vllmrunner":2759,"modified":2760,"reproducibility":2761,"block_size":2762,"64":2763,"devices":2764,"enable_chunked_prefill":2765,"enforce_eager":2766,"graph":2767,"runner":2768,"tokenizer_name":2769,"disable_log_stats":2770,"is_available":2771,"swap_space":2772,"text_prompt_kwargs":2773,"prompt_embeds":2774,"req_outputs":2775,"req_output":2776,"prompt_str":2777,"req_sample_output_ids":2778,"req_sample_output_strs":2779,"_final_steps_generate_w_logprobs":2780,"prompt_logprobs":2781,"generate_w_logprobs":2782,"toks_str_logsprobs_prompt_logprobs":2783,"omit":2784,"generate_encoder_decoder_w_logprobs":2785,"greedy_params":2786,"num_prompt_logprobs":2787,"stop_token_ids":2788,"stop":2789,"greedy_logprobs_params":2790,"generate_encoder_decoder_greedy_logprobs":2791,"num_prompt_logp":2792,"robs":2793,"returned_outputs":2794,"texts":2795,"probs":2796,"embed":2797,"reward":2798,"text_1":2799,"text_2":2800,"apply_model":2801,"func":2802,"vllm_enable_v1_multiprocessing":2803,"executor":2804,"vllm_allow_insecure_serialization":2805,"_apply_model":2806,"collective_rpc":2807,"vllm_runner":2808,"temporary_enable_log_propagate":2809,"propagate":2810,"caplog_vllm":2811,"caplog":2812,"capture":2813,"log":2814,"temporarily":2815,"logs":2816,"propagated":2817,"num_gpus_available":2818,"gpus":2819,"initializing":2820,"gettempdir":2821,"_dummy_opt_path":2822,"dummy_opt":2823,"_dummy_llava_path":2824,"dummy_llava":2825,"_dummy_gemma2_embedding_path":2826,"dummy_gemma2_embedding":2827,"dummy_opt_path":2828,"json_path":2829,"repo_id":2830,"local_dir":2831,"ignore_patterns":2832,"h5":2833,"msgpack":2834,"architectures":2835,"myoptforcausallm":2836,"dummy_llava_path":2837,"myllava":2838,"dummy_gemma2_embedding_path":2839,"baai":2840,"bge":2841,"multilingual":2842,"gemma2":2843,"mygemma2embedding":2844,"mark":2845,"pytest_addoption":2846,"addoption":2847,"pytest_collection_modifyitems":2848,"getoption":2849,"cli":2850,"skip_optional":2851,"keywords":2852,"add_marker":2853,"cli_config_file":2854,"test_config":2855,"yaml":2856,"cli_config_file_with_model":2857,"test_config_with_model":2858,"hashing":2859,"test_cache_block_hashing":2860,"token_inputs":2861,"tokenizer_group":2862,"tokenizergroup":2863,"prefixes":2864,"prefix_start":2865,"expert":2866,"prefix_common":2867,"school":2868,"principal":2869,"skilled":2870,"effectively":2871,"managing":2872,"faculty":2873,"staff":2874,"draft":2875,"potential":2876,"grade":2877,"head":2878,"teacher":2879,"girls":2880,"independent":2881,"emphasizes":2882,"community":2883,"joyful":2884,"discovery":2885,"life":2886,"learning":2887,"candidate":2888,"coming":2889,"panel":2890,"interview":2891,"8th":2892,"teaching":2893,"years":2894,"previous":2895,"experience":2896,"ed":2897,"public":2898,"middle":2899,"fulfill":2900,"sample_prompts":2901,"hello":2902,"president":2903,"united":2904,"states":2905,"france":2906,"flatten_2d":2907,"li":2908,"lss":2909,"ls":2910,"parametrize":2911,"max_num_seqs":2912,"concurrent_lora_int_ids":2913,"test_auto_prefix_caching":2914,"max_input_length":2915,"hashes":2916,"example_lora_":2917,"lora_":2918,"seq_id":2919,"seq":2920,"eos_token_id":2921,"num_blocks":2922,"hash_of_block":2923,"everywhere":2924,"hash0":2925,"hash1":2926,"until":2927,"hash_pref":2928,"same_hashes":2929,"different_hashes":2930,"ha":2931,"sh_pref":2932,"vllmbackend":2933,"loadconfig":2934,"poolerconfig":2935,"get_field":2936,"update_config":2937,"pooler":2938,"poolingtype":2939,"test_compile_config_repr_succeeds":2940,"mutates":2941,"configure_post_pass":2942,"repr":2943,"succeeds":2944,"val":2945,"inductor_passes":2946,"_testconfigfields":2947,"test_get_field":2948,"_testnestedconfig":2949,"test_update_config":2950,"simple":2951,"config1":2952,"new_config1":2953,