{"spdx": 0, "license": 1, "identifier": 2, "apache": 3, "filecopyrighttext": 4, "copyright": 5, "contributors": 6, "vllm": 7, "project": 8, "import": 9, "importlib": 10, "traceback": 11, "from": 12, "typing": 13, "callable": 14, "unittest": 15, "mock": 16, "patch": 17, "def": 18, "find_cuda_init": 19, "fn": 20, "object": 21, "none": 22, "helper": 23, "function": 24, "debug": 25, "cuda": 26, "re": 27, "initialization": 28, "errors": 29, "initializes": 30, "prints": 31, "stack": 32, "trace": 33, "how": 34, "happens": 35, "torch": 36, "_lazy_init": 37, "wrapper": 38, "nonlocal": 39, "extract_stack": 40, "return": 41, "print": 42, "initialized": 43, "join": 44, "format_list": 45, "strip": 46, "__name__": 47, "__main__": 48, "lambda": 49, "import_module": 50, "model_executor": 51, "models": 52, "llava": 53, "ctypes": 54, "util": 55, "json": 56, "logging": 57, "os": 58, "shutil": 59, "subprocess": 60, "sys": 61, "pathlib": 62, "path": 63, "which": 64, "packaging": 65, "version": 66, "parse": 67, "setuptools": 68, "extension": 69, "setup": 70, "command": 71, "build_ext": 72, "setuptools_scm": 73, "get_version": 74, "utils": 75, "cpp_extension": 76, "cuda_home": 77, "rocm_home": 78, "load_module_from_path": 79, "module_name": 80, "spec": 81, "spec_from_file_location": 82, "module": 83, "module_from_spec": 84, "modules": 85, "loader": 86, "exec_module": 87, "root_dir": 88, "__file__": 89, "parent": 90, "logger": 91, "getlogger": 92, "cannot": 93, "envs": 94, "directly": 95, "because": 96, "depends": 97, "installed": 98, "yet": 99, "py": 100, "vllm_target_device": 101, "platform": 102, "startswith": 103, "darwin": 104, "cpu": 105, "warning": 106, "automatically": 107, "set": 108, "due": 109, "macos": 110, "elif": 111, "linux": 112, "only": 113, "supports": 114, "including": 115, "wsl": 116, "building": 117, "so": 118, "may": 119, "able": 120, "run": 121, "correctly": 122, "empty": 123, "getenv": 124, "hip": 125, "available": 126, "fallback": 127, "main_cuda_version": 128, "12": 129, "lm": 130, "is_sccache_available": 131, "bool": 132, "sccache": 133, "int": 134, "vllm_disable_sccache": 135, "is_ccache_available": 136, "ccache": 137, "is_ninja_available": 138, "ninja": 139, "is_url_available": 140, "url": 141, "str": 142, "urllib": 143, "request": 144, "urlopen": 145, "status": 146, "try": 147, "except": 148, "exception": 149, "false": 150, "200": 151, "class": 152, "cmakeextension": 153, "__init__": 154, "self": 155, "name": 156, "cmake_lists_dir": 157, "kwa": 158, "super": 159, "sources": 160, "py_limited_api": 161, "true": 162, "abspath": 163, "cmake_build_ext": 164, "dict": 165, "directories": 166, "have": 167, "been": 168, "configured": 169, "did_config": 170, "determine": 171, "number": 172, "compilation": 173, "jobs": 174, "optionally": 175, "nvcc": 176, "compile": 177, "threads": 178, "compute_num_jobs": 179, "num_jobs": 180, "either": 181, "value": 182, "max_jobs": 183, "environment": 184, "variable": 185, "defined": 186, "cpus": 187, "info": 188, "using": 189, "else": 190, "sched_getaffinity": 191, "isn": 192, "universally": 193, "fall": 194, "back": 195, "cpu_count": 196, "we": 197, "get": 198, "error": 199, "here": 200, "len": 201, "attributeerror": 202, "nvcc_threads": 203, "_is_cuda": 204, "get_nvcc_cuda_version": 205, "11": 206, "when": 207, "reduce": 208, "avoid": 209, "overloading": 210, "system": 211, "max": 212, "perform": 213, "cmake": 214, "configuration": 215, "single": 216, "configure": 217, "ext": 218, "ve": 219, "already": 220, "cmakelists": 221, "txt": 222, "exit": 223, "early": 224, "select": 225, "build": 226, "type": 227, "note": 228, "optimization": 229, "level": 230, "default_cfg": 231, "relwithdebinfo": 232, "cfg": 233, "cmake_build_type": 234, "cmake_args": 235, "dcmake_build_type": 236, "format": 237, "dvllm_target_device": 238, "verbose": 239, "dcmake_verbose_makefile": 240, "dcmake_c_compiler_launcher": 241, "dcmake_cxx_compiler_launcher": 242, "dcmake_cuda_compiler_launcher": 243, "dcmake_hip_compiler_launcher": 244, "pass": 245, "python": 246, "executable": 247, "can": 248, "find": 249, "exact": 250, "match": 251, "dvllm_python_executable": 252, "reuse": 253, "dependencies": 254, "subsequent": 255, "calls": 256, "dvllm_python_path": 257, "override": 258, "base": 259, "directory": 260, "fetchc": 261, "ontent": 262, "downloads": 263, "root": 264, "deps": 265, "allows": 266, "sharing": 267, "between": 268, "profiles": 269, "plays": 270, "more": 271, "nicely": 272, "fetchcontent_base_dir": 273, "fc_base_dir": 274, "environ": 275, "dfetchcontent_base_dir": 276, "parallelism": 277, "tool": 278, "dnvcc_threads": 279, "build_tool": 280, "dcmake_job_pool_compile": 281, "string": 282, "dcmake_job_pools": 283, "default": 284, "whatever": 285, "picks": 286, "make": 287, "sure": 288, "use": 289, "dcmake_cuda_compiler": 290, "bin": 291, "check_call": 292, "cwd": 293, "build_temp": 294, "build_extensions": 295, "ensure": 296, "present": 297, "working": 298, "check_output": 299, "oserror": 300, "raise": 301, "runtimeerror": 302, "create": 303, "does": 304, "exist": 305, "exists": 306, "makedirs": 307, "targets": 308, "target_name": 309, "removeprefix": 310, "vllm_flash_attn": 311, "all": 312, "extensions": 313, "append": 314, "com": 315, "pute_num_jobs": 316, "build_args": 317, "target": 318, "install": 319, "libraries": 320, "proper": 321, "location": 322, "outdir": 323, "get_ext_fullpath": 324, "absolute": 325, "skip": 326, "same": 327, "continue": 328, "appends": 329, "prefix": 330, "contains": 331, "need": 332, "remove": 333, "range": 334, "count": 335, "should": 336, "actually": 337, "components": 338, "install_args": 339, "component": 340, "first": 341, "standard": 342, "copy": 343, "build_lib": 344, "current": 345, "included": 346, "editable": 347, "glob": 348, "files": 349, "recursive": 350, "file": 351, "dst_file": 352, "split": 353, "copying": 354, "dirname": 355, "exist_ok": 356, "copy_file": 357, "precompiled_build_ext": 358, "disables": 359, "precompiled": 360, "binaries": 361, "assert": 362, "vllm_use_precompiled": 363, "supported": 364, "builds": 365, "skipping": 366, "precompiled_wheel_utils": 367, "extracts": 368, "other": 369, "existing": 370, "wheel": 371, "staticmethod": 372, "extract_precompiled_and_patch_package": 373, "wheel_url_or_path": 374, "tempfile": 375, "zipfile": 376, "temp_dir": 377, "isfile": 378, "wheel_filename": 379, "mkdtemp": 380, "wheels": 381, "wheel_path": 382, "downloading": 383, "urlretrieve": 384, "filename": 385, "package_data_patch": 386, "files_to_copy": 387, "_c": 388, "abi3": 389, "_moe_c": 390, "_flashmla_c": 391, "_vllm_fa2_c": 392, "_vllm_fa3_c": 393, "cumem_allocator": 394, "compiled_regex": 395, "file_me": 396, "mbers": 397, "list": 398, "filter": 399, "filelist": 400, "file_members": 401, "extract": 402, "target_path": 403, "open": 404, "src": 405, "wb": 406, "dst": 407, "copyfileobj": 408, "pkg": 409, "replace": 410, "setdefault": 411, "basename": 412, "finally": 413, "removing": 414, "temporary": 415, "rmtree": 416, "get_base_commit_in_main_branch": 417, "force": 418, "nightly": 419, "mainly": 420, "used": 421, "ci": 422, "testing": 423, "vllm_test_use_precompiled_nightly_wheel": 424, "latest": 425, "commit": 426, "hash": 427, "upstream": 428, "main": 429, "branch": 430, "resp_json": 431, "curl": 432, "https": 433, "api": 434, "github": 435, "repos": 436, "commits": 437, "decode": 438, "utf": 439, "upstream_main_commit": 440, "loads": 441, "sha": 442, "docker": 443, "context": 444, "git": 445, "immutable": 446, "missing": 447, "vllm_docker_build_context": 448, "check": 449, "local": 450, "repo": 451, "cat": 452, "calledprocesserror": 453, "fetch": 454, "remote": 455, "repository": 456, "update": 457, "any": 458, "branches": 459, "ensures": 460, "ref": 461, "its": 462, "history": 463, "our": 464, "current_branch": 465, "show": 466, "base_commit": 467, "merge": 468, "valueerror": 469, "err": 470, "failed": 471, "compatible": 472, "your": 473, "dev": 474, "_no_device": 475, "has_cuda": 476, "_is_neuron": 477, "_is_tpu": 478, "_is_hip": 479, "rocm": 480, "neuron": 481, "tpu": 482, "_is_cpu": 483, "_is_xpu": 484, "xpu": 485, "_build_custom_ops": 486, "get_rocm_version": 487, "librocm": 488, "core": 489, "see": 490, "blob": 491, "d11f5c20d500f729c393680a01fa902ebf92094b": 492, "rocm_version": 493, "cpp": 494, "l21": 495, "librocm_core_file": 496, "lib": 497, "is_file": 498, "librocm_core": 499, "cdll": 500, "vererrors": 501, "c_uint32": 502, "get_rocm_core_version": 503, "getrocmversion": 504, "restype": 505, "argtypes": 506, "pointer": 507, "major": 508, "minor": 509, "byref": 510, "ypes": 511, "get_neuronxcc_version": 512, "sysconfig": 513, "site_dir": 514, "get_paths": 515, "purelib": 516, "version_file": 517, "neuronxcc": 518, "executed": 519, "successfully": 520, "fp": 521, "content": 522, "read": 523, "regular": 524, "expression": 525, "search": 526, "__version__": 527, "group": 528, "could": 529, "output": 530, "adapted": 531, "nvidia": 532, "apex": 533, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 534, "nvcc_output": 535, "universal_newlines": 536, "release_idx": 537, "index": 538, "release": 539, "nvcc_cuda_version": 540, "get_gaudi_sw_version": 541, "returns": 542, "driver": 543, "enable": 544, "console": 545, "printing": 546, "hl": 547, "smi": 548, "shell": 549, "text": 550, "capture_output": 551, "env": 552, "enable_console": 553, "returncode": 554, "stdout": 555, "ersion": 556, "get_vllm_version": 557, "write_to": 558, "_version": 559, "sep": 560, "versions": 561, "might": 562, "contain": 563, "cuda_version": 564, "cuda_version_str": 565, "source": 566, "tarball": 567, "required": 568, "pypi": 569, "sdist": 570, "argv": 571, "cu": 572, "neuron_version": 573, "neuron_version_str": 574, "runtimeerro": 575, "unknown": 576, "runtime": 577, "get_requirements": 578, "package": 579, "requirements": 580, "requirements_dir": 581, "_read_requirements": 582, "resolved_requirements": 583, "line": 584, "common": 585, "cuda_major": 586, "cuda_minor": 587, "modified_requirements": 588, "req": 589, "flash": 590, "attn": 591, "built": 592, "xt": 593, "unsupported": 594, "please": 595, "ext_modules": 596, "_rocm_c": 597, "fa3": 598, "requires": 599, "later": 600, "optional": 601, "since": 602, "doesn": 603, "produce": 604, "targeting": 605, "hopper": 606, "package_data": 607, "typed": 608, "layers": 609, "fused_moe": 610, "configs": 611, "quantization": 612, "advance": 613, "wheel_location": 614, "vllm_precompiled_wheel_location": 615, "wheel_url": 616, "ai": 617, "cp38": 618, "manylinux1_x86_64": 619, "whl": 620, "resp": 621, "warn": 622, "falling": 623, "items": 624, "extend": 625, "cmdclass": 626, "static": 627, "metadata": 628, "rather": 629, "go": 630, "pyproject": 631, "toml": 632, "install_requires": 633, "extras_require": 634, "bench": 635, "pandas": 636, "datasets": 637, "tensorizer": 638, "10": 639, "fastsafetensors": 640, "runai": 641, "model": 642, "streamer": 643, "13": 644, "s3": 645, "boto3": 646, "audio": 647, "librosa": 648, "soundfile": 649, "mistral_common": 650, "processing": 651, "video": 652, "kept": 653, "backwards": 654, "compatibility": 655, "flashinfer": 656, "updated": 657, "together": 658, "dockerfile": 659, "requires_files": 660, "cleaning": 661, "lines": 662, "readlines": 663, "lower": 664, "removed": 665, "write": 666, "done": 667, "vllm_max_size_mb": 668, "defaulting": 669, "400": 670, "mib": 671, "quota": 672, "wisely": 673, "support": 674, "issues": 675, "3792": 676, "also": 677, "sync": 678, "one": 679, "print_top_10_largest_files": 680, "zip_file": 681, "top": 682, "largest": 683, "given": 684, "zip": 685, "file_sizes": 686, "getinfo": 687, "file_size": 688, "namelist": 689, "sort": 690, "key": 691, "reverse": 692, "size": 693, "1024": 694, "2f": 695, "mbs": 696, "uncompressed": 697, "check_wheel_size": 698, "walk": 699, "file_name": 700, "endswith": 701, "wheel_size_mb": 702, "getsize": 703, "allowed": 704, "larger": 705, "mb": 706, "than": 707, "limit": 708, "within": 709, "usage": 710, "argparse": 711, "template": 712, "doctype": 713, "html": 714, "body": 715, "h1": 716, "links": 717, "href": 718, "wheel_html_escaped": 719, "br": 720, "parser": 721, "argumentparser": 722, "add_argument": 723, "help": 724, "args": 725, "parse_args": 726, "generated": 727, "cloudfront": 728, "escaping": 729, "character": 730, "2b": 731, "io": 732, "time": 733, "dataclasses": 734, "dataclass": 735, "field": 736, "union": 737, "aiohttp": 738, "huggingface_hub": 739, "constants": 740, "tqdm": 741, "asyncio": 742, "transformers": 743, "autotokenizer": 744, "pretrainedtokenizer": 745, "pretrainedtokenizerfast": 746, "simon": 747, "do": 748, "benchmark": 749, "script": 750, "without": 751, "aiohttp_timeout": 752, "clienttimeout": 753, "total": 754, "60": 755, "requestfuncinput": 756, "prompt": 757, "api_url": 758, "prompt_len": 759, "output_len": 760, "model_name": 761, "logprobs": 762, "extra_body": 763, "multi_modal_content": 764, "ignore_eos": 765, "language": 766, "requestfuncoutput": 767, "generated_text": 768, "success": 769, "latency": 770, "float": 771, "output_tokens": 772, "ttft": 773, "token": 774, "itl": 775, "default_factory": 776, "inter": 777, "latencies": 778, "tpot": 779, "avg": 780, "next": 781, "async": 782, "async_request_tgi": 783, "request_func_input": 784, "pbar": 785, "generate_stream": 786, "clientsession": 787, "trust_env": 788, "timeout": 789, "session": 790, "params": 791, "max_new_tokens": 792, "do_sample": 793, "temperature": 794, "01": 795, "tgi": 796, "accept": 797, "top_p": 798, "99": 799, "truncate": 800, "ignore_eos_token": 801, "payload": 802, "inputs": 803, "parameters": 804, "st": 805, "perf_counter": 806, "most_recent_timesta": 807, "mp": 808, "post": 809, "response": 810, "chunk_bytes": 811, "sometimes": 812, "ping": 813, "data": 814, "chunk": 815, "timestamp": 816, "decoding": 817, "phase": 818, "most_recent_timestamp": 819, "reason": 820, "exc_info": 821, "format_exception": 822, "async_request_trt_llm": 823, "accumulate_tokens": 824, "text_input": 825, "max_tokens": 826, "stream": 827, "min_length": 828, "text_output": 829, "exc_in": 830, "fo": 831, "async_request_deepspeed_mii": 832, "completions": 833, "profile": 834, "openai": 835, "must": 836, "end": 837, "deepspeed": 838, "mii": 839, "temp": 840, "headers": 841, "authorization": 842, "bearer": 843, "openai_api_key": 844, "streaming": 845, "jan": 846, "28": 847, "2024": 848, "placeholder": 849, "microsoft": 850, "pull": 851, "311": 852, "parsed_resp": 853, "await": 854, "choices": 855, "unexpected": 856, "neither": 857, "nor": 858, "found": 859, "suc": 860, "cess": 861, "async_request_openai_completions": 862, "repetition_penalty": 863, "stream_options": 864, "include_usage": 865, "first_chunk_received": 866, "some": 867, "completion": 868, "last": 869, "summary": 870, "want": 871, "special": 872, "tokens": 873, "completion_tokens": 874, "never": 875, "received": 876, "valid": 877, "calculate": 878, "marked": 879, "async_request_openai_chat_completions": 880, "chat": 881, "mm_content": 882, "isinstance": 883, "typeerror": 884, "messages": 885, "role": 886, "user": 887, "max_completion_tokens": 888, "rue": 889, "application": 890, "sse": 891, "comments": 892, "often": 893, "pings": 894, "start": 895, "colon": 896, "skipped": 897, "delta": 898, "async_request_openai_audio": 899, "lazy": 900, "placeholdermodule": 901, "dep": 902, "transcriptions": 903, "translations": 904, "en": 905, "flattened": 906, "multipart": 907, "form": 908, "stream_include_usage": 909, "stream_continuous_usage_stats": 910, "payloa": 911, "send": 912, "to_bytes": 913, "sr": 914, "buffer": 915, "bytesio": 916, "wav": 917, "seek": 918, "mm_audio": 919, "containing": 920, "formdata": 921, "add_field": 922, "content_type": 923, "get_model": 924, "pretrained_model_name_or_path": 925, "vllm_use_modelscope": 926, "modelscope": 927, "snapshot_download": 928, "model_loader": 929, "weight_utils": 930, "get_lock": 931, "lock": 932, "prevent": 933, "multiple": 934, "processes": 935, "weights": 936, "model_path": 937, "model_id": 938, "local_files_only": 939, "hf_hub_offline": 940, "ignore_file_pattern": 941, "pt": 942, "safetensors": 943, "get_tokenizer": 944, "tokenizer_mode": 945, "auto": 946, "trust_remote_code": 947, "kwargs": 948, "slow": 949, "use_fast": 950, "fast": 951, "tokenizer": 952, "mode": 953, "mistral": 954, "transformers_utils": 955, "mistraltokenizer": 956, "importerror": 957, "pip": 958, "from_pretrained": 959, "async_request_funcs": 960, "lmdeploy": 961, "opena": 962, "tensorrt": 963, "llm": 964, "scalellm": 965, "sglang": 966, "llama": 967, "openai_compatible_backends": 968, "gc": 969, "tabulate": 970, "benchmark_utils": 971, "timecollector": 972, "flexibleargumentparser": 973, "v1": 974, "block_pool": 975, "blockpool": 976, "rows": 977, "allocate_block": 978, "allocate_blocks": 979, "enforce": 980, "collect": 981, "ahead": 982, "minimize": 983, "impact": 984, "among": 985, "runs": 986, "num_gpu_blocks": 987, "enable_caching": 988, "get_blocks_times": 989, "us": 990, "free_blocks_times": 991, "num_iteration": 992, "blocks": 993, "get_new_blocks": 994, "free_blocks": 995, "cnt": 996, "dump_avg_max": 997, "iterations": 998, "nblocks": 999, "allocated": 1000, "navg": 1001, "nmax": 1002, "free": 1003, "tablefmt": 1004, "grid": 1005, "floatfmt": 1006, "3f": 1007, "times": 1008, "invoke_main": 1009, "description": 1010, "performance": 1011, "kv": 1012, "cache": 1013, "num": 1014, "gpu": 1015, "100000": 1016, "iteration": 1017, "1000": 1018, "stablize": 1019, "final": 1020, "readings": 1021, "allocate": 1022, "nargs": 1023, "50": 1024, "100": 1025, "500": 1026, "pragma": 1027, "cover": 1028, "defines": 1029, "framework": 1030, "sampling": 1031, "requests": 1032, "various": 1033, "each": 1034, "dataset": 1035, "subclass": 1036, "benchmarkdataset": 1037, "implement": 1038, "sample": 1039, "generation": 1040, "types": 1041, "include": 1042, "sharegpt": 1043, "random": 1044, "synthetic": 1045, "sonnet": 1046, "burstgpt": 1047, "huggingface": 1048, "visionarena": 1049, "base64": 1050, "abc": 1051, "abstractmethod": 1052, "collections": 1053, "mapping": 1054, "functools": 1055, "numpy": 1056, "np": 1057, "pd": 1058, "load_dataset": 1059, "pil": 1060, "image": 1061, "pretrainedtokenizerbase": 1062, "lora": 1063, "lorarequest": 1064, "get_adapter_absolute_path": 1065, "multimodal": 1066, "multimodaldatadict": 1067, "convert_image_mode": 1068, "anytokenizer": 1069, "get_lora_tokenizer": 1070, "classes": 1071, "samplerequest": 1072, "represents": 1073, "inference": 1074, "benchmarking": 1075, "expected_output_len": 1076, "multi_modal_data": 1077, "lora_request": 1078, "default_seed": 1079, "is_multimodal": 1080, "dataset_path": 1081, "random_seed": 1082, "initialize": 1083, "seed": 1084, "indicates": 1085, "reproducible": 1086, "shuffling": 1087, "defaults": 1088, "ensuring": 1089, "replaced": 1090, "apply_multimodal_chat_transformation": 1091, "transform": 1092, "method": 1093, "expect": 1094, "specific": 1095, "conversation": 1096, "load_data": 1097, "load": 1098, "met": 1099, "hod": 1100, "overridden": 1101, "subclasses": 1102, "vary": 1103, "depending": 1104, "raises": 1105, "notimplementederror": 1106, "todo": 1107, "jenniferzhao": 1108, "add": 1109, "implemented": 1110, "get_random_lora_request": 1111, "max_loras": 1112, "lora_path": 1113, "tuple": 1114, "associated": 1115, "provided": 1116, "randomly": 1117, "selects": 1118, "based": 1119, "retrieves": 1120, "cached": 1121, "otherwise": 1122, "selected": 1123, "maximum": 1124, "loras": 1125, "disk": 1126, "where": 1127, "element": 1128, "applicable": 1129, "second": 1130, "generate": 1131, "id": 1132, "lora_id": 1133, "randint": 1134, "lora_name": 1135, "lora_int_id": 1136, "lora_path_on_disk": 1137, "lora_tokenizer_cac": 1138, "he": 1139, "lora_tokenizer_cache": 1140, "num_requests": 1141, "abstract": 1142, "logic": 1143, "generating": 1144, "objects": 1145, "maybe_oversample_requests": 1146, "oversamples": 1147, "less": 1148, "desired": 1149, "sampled": 1150, "additional": 1151, "oversampled": 1152, "reach": 1153, "samples": 1154, "utility": 1155, "functions": 1156, "global": 1157, "caches": 1158, "is_valid_sequence": 1159, "min_len": 1160, "max_prompt_len": 1161, "max_total_len": 1162, "2048": 1163, "skip_min_output_len_check": 1164, "validate": 1165, "sequence": 1166, "lengths": 1167, "pruning": 1168, "criteria": 1169, "copied": 1170, "original": 1171, "sample_hf_requests": 1172, "sample_sharegpt_requests": 1173, "benchmark_serving": 1174, "well": 1175, "sample_requests": 1176, "benchmark_throughput": 1177, "invalid": 1178, "conditions": 1179, "prompt_too_short": 1180, "output_too_short": 1181, "prompt_too_long": 1182, "combined_too_long": 1183, "tokenizers": 1184, "utput_len": 1185, "process_image": 1186, "process": 1187, "input": 1188, "multimedia": 1189, "dictionary": 1190, "three": 1191, "raw": 1192, "bytes": 1193, "expects": 1194, "converts": 1195, "rgb": 1196, "saves": 1197, "jpeg": 1198, "memory": 1199, "encodes": 1200, "treats": 1201, "prepends": 1202, "http": 1203, "image_data": 1204, "save": 1205, "image_base64": 1206, "b64encode": 1207, "getvalue": 1208, "image_url": 1209, "ty": 1210, "pe": 1211, "implementation": 1212, "randomdataset": 1213, "values": 1214, "default_prefix_len": 1215, "default_range_ratio": 1216, "default_input_len": 1217, "default_output_len": 1218, "128": 1219, "prefix_len": 1220, "range_ratio": 1221, "input_len": 1222, "random_range_ratio": 1223, "vocab_size": 1224, "num_special_tokens": 1225, "num_special_tokens_to_add": 1226, "real_input_len": 1227, "prefix_token_ids": 1228, "tolist": 1229, "new": 1230, "input_low": 1231, "input_high": 1232, "output_low": 1233, "bound": 1234, "length": 1235, "least": 1236, "whi": 1237, "ch": 1238, "cause": 1239, "failures": 1240, "output_high": 1241, "debugging": 1242, "input_lens": 1243, "output_lens": 1244, "offsets": 1245, "inner_seq": 1246, "arange": 1247, "token_sequence": 1248, "after": 1249, "encode": 1250, "again": 1251, "cases": 1252, "consecutive": 1253, "give": 1254, "tokenized": 1255, "example": 1256, "gpt2tokenizer": 1257, "6880": 1258, "6881": 1259, "ġcalls": 1260, "1650": 1261, "939": 1262, "486": 1263, "ġcall": 1264, "sh": 1265, "ere": 1266, "uncontrolled": 1267, "change": 1268, "encoded": 1269, "truncated": 1270, "before": 1271, "being": 1272, "total_input_len": 1273, "re_encoded_sequence": 1274, "add_special_tokens": 1275, "otal_input_len": 1276, "sharegptdataset": 1277, "implements": 1278, "generates": 1279, "turns": 1280, "loading": 1281, "encoding": 1282, "entries": 1283, "two": 1284, "entry": 1285, "conversations": 1286, "shuffle": 1287, "enable_multimodal_chat": 1288, "break": 1289, "prompt_ids": 1290, "input_ids": 1291, "completion_ids": 1292, "new_output_len": 1293, "sharegpt4video": 1294, "image_path": 1295, "custom": 1296, "customdataset": 1297, "jsonl": 1298, "what": 1299, "capital": 1300, "india": 1301, "iran": 1302, "china": 1303, "dictionaries": 1304, "standardized": 1305, "has": 1306, "convert": 1307, "filetype": 1308, "assume": 1309, "jsonl_data": 1310, "read_json": 1311, "path_or_buf": 1312, "column": 1313, "columns": 1314, "row": 1315, "dataframe": 1316, "corresponds": 1317, "iterrows": 1318, "to_dict": 1319, "skip_chat_template": 1320, "sampled_requests": 1321, "item": 1322, "apply": 1323, "apply_chat_template": 1324, "add_generation_prompt": 1325, "tokenize": 1326, "ppend": 1327, "sonnetdataset": 1328, "simplified": 1329, "poem": 1330, "550": 1331, "150": 1332, "return_prompt_formatted": 1333, "average": 1334, "tokenized_lines": 1335, "avg_len": 1336, "sum": 1337, "base_prompt": 1338, "pick": 1339, "many": 1340, "you": 1341, "base_msg": 1342, "base_fmt": 1343, "ize": 1344, "base_offset": 1345, "higher": 1346, "num_input_lines": 1347, "round": 1348, "num_prefix_lines": 1349, "prefix_lines": 1350, "while": 1351, "extra_lines": 1352, "msg": 1353, "prompt_formatted": 1354, "ples": 1355, "burstgptdataset": 1356, "csv": 1357, "gpt": 1358, "positive": 1359, "df": 1360, "read_csv": 1361, "keep": 1362, "gpt4_df": 1363, "_sample_loaded_data": 1364, "random_state": 1365, "lists": 1366, "lora_req": 1367, "ids": 1368, "computed": 1369, "modulo": 1370, "token_ids": 1371, "oken_ids": 1372, "huggingfacedataset": 1373, "hosted": 1374, "supported_dataset_paths": 1375, "dataset_split": 1376, "no_stream": 1377, "dataset_subset": 1378, "load_stream": 1379, "conversationdataset": 1380, "lmms": 1381, "lab": 1382, "onevision": 1383, "aeala": 1384, "sharegpt_vicuna_unfiltered": 1385, "examples": 1386, "filtered_data": 1387, "dynamic_output": 1388, "conv": 1389, "completion_len": 1390, "enabled": 1391, "longer": 1392, "accurate": 1393, "actual": 1394, "vision": 1395, "arena": 1396, "visionarenadataset": 1397, "lmarena": 1398, "v0": 1399, "parser_fn": 1400, "images": 1401, "instruct": 1402, "coder": 1403, "instructcoderdataset": 1404, "instructcoder": 1405, "co": 1406, "likaixin": 1407, "designed": 1408, "general": 1409, "code": 1410, "editing": 1411, "consists": 1412, "114": 1413, "239": 1414, "instruction": 1415, "triplets": 1416, "covers": 1417, "distinct": 1418, "scenario": 1419, "just": 1420, "explanation": 1421, "mt": 1422, "pend": 1423, "mtbenchdataset": 1424, "philschmid": 1425, "turn": 1426, "similar": 1427, "9d98ab5ec": 1428, "offline_inference": 1429, "eagle": 1430, "l14": 1431, "l18": 1432, "noqa": 1433, "e501": 1434, "256": 1435, "sd": 1436, "aimo": 1437, "aimodataset": 1438, "reasoning": 1439, "questions": 1440, "mo": 1441, "validation": 1442, "aime": 1443, "numinamath": 1444, "cot": 1445, "problem": 1446, "solution": 1447, "32000": 1448, "edit": 1449, "prediction": 1450, "zeta_prompt": 1451, "assistant": 1452, "task": 1453, "analyze": 1454, "edits": 1455, "rewrite": 1456, "excerpt": 1457, "provides": 1458, "suggesting": 1459, "appropriate": 1460, "taking": 1461, "account": 1462, "cursor": 1463, "_format_zeta_prompt": 1464, "original_start_marker": 1465, "editable_region_start": 1466, "zeta": 1467, "nep": 1468, "formats": 1469, "prompts": 1470, "expected": 1471, "outputs": 1472, "further": 1473, "extended": 1474, "events": 1475, "marker": 1476, "indicating": 1477, "region": 1478, "formatted": 1479, "following": 1480, "focused": 1481, "output_start_index": 1482, "output_focused_region": 1483, "expected_output": 1484, "rompts": 1485, "nexteditpredictiondataset": 1486, "zed": 1487, "industries": 1488, "mapping_prompt_funcs": 1489, "formatting_prompt_func": 1490, "asr": 1491, "asrdataset": 1492, "transcription": 1493, "tested": 1494, "domain": 1495, "speaking": 1496, "style": 1497, "hf": 1498, "subset": 1499, "ted": 1500, "lium": 1501, "talks": 1502, "oratory": 1503, "release1": 1504, "release2": 1505, "release3": 1506, "speaker": 1507, "adaptation": 1508, "voxpopuli": 1509, "european": 1510, "parliament": 1511, "de": 1512, "fr": 1513, "librispeech": 1514, "audiobook": 1515, "narrated": 1516, "tedlium": 1517, "gigaspeech": 1518, "podcast": 1519, "youtube": 1520, "spontaneous": 1521, "xs": 1522, "xl": 1523, "test": 1524, "spgispeech": 1525, "financial": 1526, "meetings": 1527, "ami": 1528, "ihm": 1529, "sdm": 1530, "openslr": 1531, "librispeech_asr": 1532, "facebook": 1533, "edinburghcstr": 1534, "speechcolab": 1535, "kensho": 1536, "whisper": 1537, "interface": 1538, "transcription_preamble": 1539, "startoftranscript": 1540, "transcribe": 1541, "notimestamps": 1542, "skip_long_audios": 1543, "array": 1544, "sampling_rate": 1545, "duration_s": 1546, "get_duration": 1547, "duration": 1548, "30": 1549, "discarded": 1550, "greater": 1551, "sampled_reque": 1552, "sts": 1553, "batch": 1554, "typing_extensions": 1555, "deprecated": 1556, "convert_to_pytorch_benchmark_format": 1557, "write_to_json": 1558, "samplingparams": 1559, "engine": 1560, "arg_utils": 1561, "engineargs": 1562, "prompttype": 1563, "sampling_params": 1564, "beamsearchparams": 1565, "save_to_pytorch_benchmark_format": 1566, "namespace": 1567, "results": 1568, "pt_records": 1569, "metrics": 1570, "extra_info": 1571, "avg_latency": 1572, "percentiles": 1573, "pt_file": 1574, "splitext": 1575, "output_json": 1576, "pytorch": 1577, "benchmark_latency": 1578, "future": 1579, "instead": 1580, "engine_args": 1581, "from_cli_args": 1582, "woosuk": 1583, "processed": 1584, "batches": 1585, "asdict": 1586, "llm_engine": 1587, "model_config": 1588, "max_model_len": 1589, "detokenize": 1590, "disable_detokenize": 1591, "dummy_prompt_token_ids": 1592, "10000": 1593, "batch_size": 1594, "dummy_prompts": 1595, "prompt_token_ids": 1596, "llm_generate": 1597, "use_beam_search": 1598, "use_tqdm": 1599, "beam_search": 1600, "beam_width": 1601, "run_to_completion": 1602, "profile_dir": 1603, "profile_": 1604, "dir": 1605, "start_profile": 1606, "stop_profile": 1607, "start_time": 1608, "end_time": 1609, "warming": 1610, "up": 1611, "num_iters_warmup": 1612, "desc": 1613, "warmup": 1614, "vllm_torch_profiler_dir": 1615, "profiling": 1616, "saved": 1617, "num_iters": 1618, "percentages": 1619, "25": 1620, "75": 1621, "90": 1622, "percentile": 1623, "mean": 1624, "seconds": 1625, "percentage": 1626, "specified": 1627, "dump": 1628, "indent": 1629, "es": 1630, "create_argument_parser": 1631, "till": 1632, "32": 1633, "sequences": 1634, "per": 1635, "beam": 1636, "action": 1637, "store_true": 1638, "iters": 1639, "disable": 1640, "responses": 1641, "detokenization": 1642, "measurement": 1643, "add_cli_args": 1644, "enables": 1645, "caching": 1646, "skews": 1647, "numbers": 1648, "set_defaults": 1649, "enable_prefix_caching": 1650, "profiler": 1651, "offline": 1652, "long": 1653, "document": 1654, "qa": 1655, "throughput": 1656, "workload": 1657, "different": 1658, "20000": 1659, "replicates": 1660, "order": 1661, "benchmark_long_document_qa_throughput": 1662, "meta": 1663, "7b": 1664, "documents": 1665, "repeat": 1666, "commandline": 1667, "arguments": 1668, "modes": 1669, "tile": 1670, "entire": 1671, "repeated": 1672, "potentially": 1673, "lowest": 1674, "hit": 1675, "interleave": 1676, "consecutively": 1677, "moving": 1678, "highest": 1679, "meantime": 1680, "refer": 1681, "details": 1682, "test_long_document_qa": 1683, "spent": 1684, "parameter": 1685, "strings": 1686, "execute": 1687, "4f": 1688, "secs": 1689, "repeat_prompts": 1690, "repeat_count": 1691, "repetition": 1692, "repeated_prompts": 1693, "shuffle_seed": 1694, "prepare": 1695, "beginning": 1696, "hi": 1697, "document_length": 1698, "num_documents": 1699, "repeat_mode": 1700, "warmup_prompts": 1701, "warm": 1702, "ine": 1703, "automatic": 1704, "roughly": 1705, "paper": 1706, "excluding": 1707, "min": 1708, "config": 1709, "modelconfig": 1710, "speculativeconfig": 1711, "vllmconfig": 1712, "spec_decode": 1713, "ngram_proposer": 1714, "ngramproposer": 1715, "max_ngram": 1716, "collector": 1717, "opt": 1718, "125m": 1719, "num_token": 1720, "num_spec_token": 1721, "dtype": 1722, "proposer": 1723, "vllm_config": 1724, "speculative_config": 1725, "prompt_lookup_min": 1726, "min_ngram": 1727, "prompt_lookup_max": 1728, "num_speculative_tokens": 1729, "ngram": 1730, "propose": 1731, "20": 1732, "num_req": 1733, "gram": 1734, "speculative": 1735, "drafting": 1736, "1500": 1737, "minimum": 1738, "15": 1739, "efficiency": 1740, "fixed": 1741, "benchmark_prefix_caching": 1742, "sharegpt_v3_unfiltered_cleaned_split": 1743, "backend_request_func": 1744, "helpful": 1745, "recognizes": 1746, "tables": 1747, "markdown": 1748, "table": 1749, "fellows": 1750, "answer": 1751, "my": 1752, "question": 1753, "about": 1754, "opening": 1755, "sl": 1756, "film": 1757, "cast": 1758, "director": 1759, "music": 1760, "notes": 1761, "agni": 1762, "pushpam": 1763, "jayabharathi": 1764, "kamalahasan": 1765, "jeassy": 1766, "arjunan": 1767, "16": 1768, "priyamvada": 1769, "mohan": 1770, "sharma": 1771, "lakshmi": 1772, "kpac": 1773, "lalitha": 1774, "sethumadhavan": 1775, "dakshinamoorthy": 1776, "23": 1777, "yakshagaanam": 1778, "madhu": 1779, "sheela": 1780, "viswanathan": 1781, "paalkkada": 1782, "sharada": 1783, "prasad": 1784, "ummer": 1785, "amma": 1786, "srividya": 1787, "krishnan": 1788, "nair": 1789, "appooppan": 1790, "thikkurissi": 1791, "sukumaran": 1792, "kamal": 1793, "haasan": 1794, "bhaskaran": 1795, "baburaj": 1796, "srishti": 1797, "chowalloor": 1798, "krishnankutty": 1799, "ravi": 1800, "alummoodu": 1801, "muhammad": 1802, "vanadevatha": 1803, "prem": 1804, "nazir": 1805, "madhubala": 1806, "yusufali": 1807, "kechery": 1808, "devarajan": 1809, "27": 1810, "samasya": 1811, "kamalahaasan": 1812, "thankappan": 1813, "shyam": 1814, "yudhabhoomi": 1815, "vidhubala": 1816, "crossbelt": 1817, "mani": 1818, "shekhar": 1819, "seemantha": 1820, "puthran": 1821, "raj": 1822, "swapnadanam": 1823, "rani": 1824, "chandra": 1825, "dr": 1826, "mohandas": 1827, "george": 1828, "bhaskar": 1829, "chandavarkar": 1830, "19": 1831, "thulavarsham": 1832, "sreedevi": 1833, "sudheer": 1834, "sankaran": 1835, "14": 1836, "aruthu": 1837, "kaviyoor": 1838, "ponnamma": 1839, "26": 1840, "swimming": 1841, "pool": 1842, "soman": 1843, "sasikumar": 1844, "nwhat": 1845, "cells": 1846, "test_prefix": 1847, "cost": 1848, "sample_tokens": 1849, "vocab": 1850, "get_vocab": 1851, "all_special_ids": 1852, "ms": 1853, "sample_requests_from_dataset": 1854, "input_length_range": 1855, "fixed_output_len": 1856, "too": 1857, "small": 1858, "out": 1859, "max_len": 1860, "short": 1861, "filtered_requests": 1862, "completion_token_ids": 1863, "fixed_ou": 1864, "tput_len": 1865, "sample_requests_from_random": 1866, "unique_part_token_ids": 1867, "repeat_and_sort_requests": 1868, "repeated_requests": 1869, "map": 1870, "num_prompts": 1871, "stats": 1872, "prompt_lens": 1873, "p50": 1874, "sorted": 1875, "filtered": 1876, "specifies": 1877, "added": 1878, "subtract": 1879, "filtering": 1880, "tim": 1881, "prioritization": 1882, "equi": 1883, "probable": 1884, "priority": 1885, "get_random_flag": 1886, "tifier": 1887, "filtered_dataset": 1888, "prune": 1889, "prompt_le": 1890, "run_vllm": 1891, "_priority": 1892, "synthesize": 1893, "backend": 1894, "elapsed_time": 1895, "total_num_tokens": 1896, "requests_per_second": 1897, "tokens_per_second": 1898, "ith": 1899, "overrides": 1900, "online": 1901, "serving": 1902, "server": 1903, "side": 1904, "commands": 1905, "serve": 1906, "your_model": 1907, "swap": 1908, "space": 1909, "client": 1910, "benchmarks": 1911, "rate": 1912, "request_rate": 1913, "inf": 1914, "endpoint": 1915, "above": 1916, "warnings": 1917, "iterable": 1918, "datetime": 1919, "literal": 1920, "benchmark_dataset": 1921, "se": 1922, "rve": 1923, "get_request": 1924, "milliseconds_to_seconds_conversion": 1925, "benchmarkmetrics": 1926, "completed": 1927, "total_input": 1928, "total_output": 1929, "request_throughput": 1930, "request_goodput": 1931, "output_throughput": 1932, "total_token_throughput": 1933, "mean_ttft_ms": 1934, "median_ttft_ms": 1935, "std_ttft_ms": 1936, "percentiles_ttft_ms": 1937, "mean_tpot_ms": 1938, "median_tpot_ms": 1939, "std_tpot_ms": 1940, "percentiles_tpot_ms": 1941, "mean_itl_ms": 1942, "median_itl_ms": 1943, "std_itl_ms": 1944, "percentiles_itl_ms": 1945, "e2el": 1946, "stands": 1947, "taken": 1948, "sending": 1949, "receiving": 1950, "complete": 1951, "mean_e2el_ms": 1952, "median_e2el_ms": 1953, "std_e2el_ms": 1954, "percentiles_e2el_ms": 1955, "n_tpot_ms": 1956, "calculate_metrics": 1957, "input_requests": 1958, "dur_s": 1959, "selected_percentile_metrics": 1960, "selected_percentiles": 1961, "goodput_config_dict": 1962, "actual_output_lens": 1963, "good_completed": 1964, "itls": 1965, "tpots": 1966, "all_tpots": 1967, "ttfts": 1968, "e2els": 1969, "backends": 1970, "looking": 1971, "bundled": 1972, "inflate": 1973, "slightly": 1974, "latency_minus_ttft": 1975, "latency_minu": 1976, "s_ttft": 1977, "regard": 1978, "goodput": 1979, "valid_metrics": 1980, "slo_values": 1981, "req_metric": 1982, "is_good_req": 1983, "likely": 1984, "misconfiguration": 1985, "stacklevel": 1986, "std": 1987, "median": 1988, "base_url": 1989, "burstiness": 1990, "disable_tqdm": 1991, "max_concurrency": 1992, "lora_modules": 1993, "ramp_up_strategy": 1994, "linear": 1995, "exponential": 1996, "ramp_up_start_rps": 1997, "ramp_up_end_rps": 1998, "request_func": 1999, "starting": 2000, "initial": 2001, "test_prompt": 2002, "test_prompt_len": 2003, "test_output_len": 2004, "test_mm_content": 2005, "test_input": 2006, "test_output": 2007, "choose": 2008, "iter": 2009, "choice": 2010, "profile_input": 2011, "profile_output": 2012, "started": 2013, "distribution": 2014, "poisson": 2015, "gamma": 2016, "traffic": 2017, "ramp": 2018, "strategy": 2019, "increase": 2020, "rps": 2021, "over": 2022, "factor": 2023, "concurrency": 2024, "once": 2025, "simplify": 2026, "limited_request_func": 2027, "semaphore": 2028, "contextlib": 2029, "nullcontext": 2030, "benchmark_start_time": 2031, "tasks": 2032, "rps_change_events": 2033, "last_int_rps": 2034, "now": 2035, "isoformat": 2036, "current_request_rate": 2037, "current_int_rps": 2038, "rps_val": 2039, "req_model_id": 2040, "req_model_name": 2041, "req_lora_module": 2042, "create_task": 2043, "gather": 2044, "close": 2045, "benchmark_duration": 2046, "result": 2047, "40": 2048, "successful": 2049, "metri": 2050, "cs": 2051, "tok": 2052, "total_input_tokens": 2053, "total_output_tokens": 2054, "generated_texts": 2055, "pr": 2056, "ocess_one_metric": 2057, "metric_attribute_name": 2058, "metric_name": 2059, "metric_header": 2060, "adds": 2061, "statistics": 2062, "metric": 2063, "getattr": 2064, "mean_": 2065, "_ms": 2066, "median_": 2067, "std_": 2068, "percentiles_": 2069, "p_word": 2070, "process_one_metric": 2071, "excl": 2072, "1st": 2073, "stopping": 2074, "stop_prof": 2075, "ile": 2076, "stopped": 2077, "check_goodput_args": 2078, "valid_names": 2079, "parse_goodput": 2080, "slo_name": 2081, "slo_val": 2082, "service": 2083, "objective": 2084, "non": 2085, "negative": 2086, "slo_pairs": 2087, "slo_pair": 2088, "argumenttypeerror": 2089, "objectives": 2090, "specify": 2091, "pairs": 2092, "milliseconds": 2093, "p99_ttft_ms": 2094, "p99_tpot_ms": 2095, "p99_itl_ms": 2096, "useful": 2097, "big": 2098, "needed": 2099, "ignored_metrics": 2100, "don": 2101, "suffix": 2102, "served_model_name": 2103, "tokenizer_id": 2104, "controlled": 2105, "argument": 2106, "both": 2107, "base_ur": 2108, "host": 2109, "port": 2110, "dataset_name": 2111, "corresponding": 2112, "custom_output_len": 2113, "custom_skip_chat_template": 2114, "formatting": 2115, "sonnet_input_len": 2116, "sonnet_output_len": 2117, "sonnet_prefix_len": 2118, "chat_template": 2119, "default_chat_template": 2120, "om": 2121, "dataset_class": 2122, "hf_split": 2123, "train": 2124, "hf_subset": 2125, "supported_datasets": 2126, "cls": 2127, "__subclasses__": 2128, "consider": 2129, "contributing": 2130, "would": 2131, "like": 2132, "multi": 2133, "modal": 2134, "hf_output_len": 2135, "follow": 2136, "structure": 2137, "dataset_mapping": 2138, "sharegpt_output_len": 2139, "random_prefix_len": 2140, "random_input_len": 2141, "random_output_len": 2142, "keyerror": 2143, "top_k": 2144, "min_p": 2145, "greedy": 2146, "cache_prompt": 2147, "pause": 2148, "freeze": 2149, "benchmark_result": 2150, "percentile_metrics": 2151, "metric_percentiles": 2152, "save_result": 2153, "append_result": 2154, "result_json": 2155, "current_dt": 2156, "strftime": 2157, "dat": 2158, "kvstring": 2159, "save_detailed": 2160, "fields": 2161, "points": 2162, "del": 2163, "base_model_id": 2164, "max_concurrency_str": 2165, "qps": 2166, "result_filename": 2167, "result_dir": 2168, "outfile": 2169, "newline": 2170, "tell": 2171, "keys": 2172, "127": 2173, "localhost": 2174, "ipv4": 2175, "8000": 2176, "concurrent": 2177, "simulate": 2178, "enforcing": 2179, "controls": 2180, "initiated": 2181, "control": 2182, "means": 2183, "combination": 2184, "enough": 2185, "compute": 2186, "part": 2187, "unspecified": 2188, "disabled": 2189, "dummy": 2190, "logprob": 2191, "returned": 2192, "sent": 2193, "arrival": 2194, "burstine": 2195, "ss": 2196, "take": 2197, "effect": 2198, "follows": 2199, "intervals": 2200, "bursty": 2201, "uniform": 2202, "trust": 2203, "progress": 2204, "bar": 2205, "launched": 2206, "detailed": 2207, "saving": 2208, "whether": 2209, "information": 2210, "ttfs": 2211, "etc": 2212, "metavar": 2213, "tp": 2214, "record": 2215, "keeping": 2216, "purposes": 2217, "ignore": 2218, "eos": 2219, "flag": 2220, "deepspeed_mii": 2221, "comma": 2222, "separated": 2223, "report": 2224, "percentils": 2225, "names": 2226, "th": 2227, "spaces": 2228, "definition": 2229, "distserve": 2230, "arxiv": 2231, "org": 2232, "pdf": 2233, "2401": 2234, "09670": 2235, "blog": 2236, "hao": 2237, "blogs": 2238, "custom_group": 2239, "add_argument_group": 2240, "aset": 2241, "options": 2242, "applying": 2243, "sonnet_group": 2244, "sharegpt_group": 2245, "random_group": 2246, "ratio": 2247, "define": 2248, "symmetric": 2249, "hf_group": 2250, "sampling_group": 2251, "always": 2252, "preregistered": 2253, "served": 2254, "passed": 2255, "launching": 2256, "chooses": 2257, "needs": 2258, "ending": 2259, "structured": 2260, "benchmark_serving_structured_output": 2261, "uuid": 2262, "asyncgenerator": 2263, "structured_output": 2264, "backend_xgrammar": 2265, "has_xgrammar_unsupported_json_features": 2266, "st_funcs": 2267, "representing": 2268, "attributes": 2269, "schema": 2270, "structure_type": 2271, "resenting": 2272, "unique": 2273, "json_schema_path": 2274, "dir_path": 2275, "realpath": 2276, "structured_schemas": 2277, "structured_schema_1": 2278, "json_schemas": 2279, "deepcopy": 2280, "properties": 2281, "__optional_field_": 2282, "uuid4": 2283, "schemas": 2284, "gen_prompt": 2285, "brief": 2286, "dumps": 2287, "get_schema": 2288, "grammar": 2289, "select_statement": 2290, "condition": 2291, "col_1": 2292, "col_2": 2293, "table_1": 2294, "table_2": 2295, "sql": 2296, "query": 2297, "username": 2298, "email": 2299, "users": 2300, "regex": 2301, "address": 2302, "alan": 2303, "turing": 2304, "who": 2305, "works": 2306, "enigma": 2307, "ify": 2308, "sentiment": 2309, "wonderful": 2310, "xgrammar_bench": 2311, "nousresearch": 2312, "eval": 2313, "full_dataset_len": 2314, "_filter_func": 2315, "num_filtered_out": 2316, "features": 2317, "len_dataset": 2318, "data_point_idx": 2319, "idx": 2320, "asynchronously": 2321, "represented": 2322, "takes": 2323, "scale": 2324, "theta": 2325, "maintain": 2326, "enumerate": 2327, "yield": 2328, "infinity": 2329, "wait": 2330, "interval": 2331, "shape": 2332, "sleep": 2333, "quest": 2334, "rcentile": 2335, "structured_output_ratio": 2336, "prepare_extra_body": 2337, "structured_output_req_idx": 2338, "test_": 2339, "test_req_extra_body": 2340, "test_request": 2341, "_concurrency": 2342, "equest_rate": 2343, "ttft_description": 2344, "series": 2345, "describe": 2346, "tpot_description": 2347, "ret": 2348, "gt": 2349, "pro": 2350, "mpt_len": 2351, "evaluate": 2352, "_eval_correctness_json": 2353, "_eval_correctness_choice": 2354, "_eval_correctness_regex": 2355, "_eval_correctness": 2356, "guided_json": 2357, "guided_regex": 2358, "guided_choice": 2359, "scores": 2360, "res": 2361, "score": 2362, "correctness": 2363, "not_none_scores": 2364, "guided_grammar": 2365, "no_structured_output": 2366, "save_results": 2367, "result_file_name": 2368, "guided": 2369, "_out": 2370, "correct_rate": 2371, "add_arg": 2372, "ument": 2373, "percenti": 2374, "les": 2375, "uvloop": 2376, "automodelforcausallm": 2377, "asyncengineargs": 2378, "entrypoints": 2379, "api_server": 2380, "build_async_engine_client_from_engine_args": 2381, "textprompt": 2382, "tokensprompt": 2383, "requestoutput": 2384, "merge_async_iterators": 2385, "taset": 2386, "lora_requests": 2387, "engine_a": 2388, "rgs": 2389, "enable_lora": 2390, "beamsearch": 2391, "run_vllm_chat": 2392, "recommended": 2393, "properly": 2394, "handles": 2395, "run_vllm_async": 2396, "asy": 2397, "ncengineargs": 2398, "disable_frontend_multiprocessing": 2399, "get_model_config": 2400, "generators": 2401, "sp": 2402, "lr": 2403, "generator": 2404, "request_id": 2405, "all_gens": 2406, "run_hf": 2407, "max_batch_size": 2408, "torch_dtype": 2409, "float16": 2410, "model_type": 2411, "padding": 2412, "pad_token": 2413, "eos_token": 2414, "max_output_len": 2415, "next_prompt_len": 2416, "next_output_len": 2417, "gener": 2418, "ate": 2419, "return_tensors": 2420, "llm_outputs": 2421, "num_return_sequences": 2422, "use_cache": 2423, "batch_decode": 2424, "skip_special_tokens": 2425, "clear": 2426, "run_mii": 2427, "tensor_parallel_size": 2428, "tensor_parallel": 2429, "terminate_server": 2430, "get_requests": 2431, "common_kwargs": 2432, "sample_kwargs": 2433, "dataset_cls": 2434, "is_multi_modal": 2435, "request_outputs": 2436, "async_engine": 2437, "hf_max_batch_size": 2438, "_size": 2439, "total_prompt_tokens": 2440, "ro": 2441, "033": 2442, "91mwarning": 2443, "0m": 2444, "detected": 2445, "counted": 2446, "9778": 2447, "counts": 2448, "put": 2449, "validate_args": 2450, "deprecation": 2451, "valid_backends": 2452, "checks": 2453, "ignored": 2454, "arg": 2455, "settings": 2456, "validations": 2457, "rais": 2458, "parallel": 2459, "currently": 2460, "16222": 2461, "data_parallel_size": 2462, "prompt_or_response": 2463, "equences": 2464, "frontend": 2465, "multiprocessing": 2466, "decoupled": 2467, "adapters": 2468, "relative": 2469, "hugging": 2470, "face": 2471, "much": 2472, "versus": 2473, "remains": 2474, "approximately": 2475, "input_le": 2476, "dtaset": 2477, "math": 2478, "tracebacktype": 2479, "oss": 2480, "wiki": 2481, "integrate": 2482, "database": 2483, "records": 2484, "benchmark_values": 2485, "vars": 2486, "mark_values": 2487, "infencoder": 2488, "jsonencoder": 2489, "clear_inf": 2490, "isinf": 2491, "iterencode": 2492, "serializable": 2493, "total_iteration": 2494, "ns": 2495, "_sum": 2496, "_max": 2497, "monotonic_ns": 2498, "__enter__": 2499, "__exit__": 2500, "exc_type": 2501, "baseexception": 2502, "exc_value": 2503, "exc_traceback": 2504, "usr": 2505, "python3": 2506, "running": 2507, "hipify": 2508, "preprocessor": 2509, "hipify_torch": 2510, "hipify_python": 2511, "live": 2512, "project_dir": 2513, "hipified": 2514, "written": 2515, "output_dir": 2516, "scope": 2517, "includes": 2518, "extra_files": 2519, "hold": 2520, "copytree": 2521, "dirs_exist_ok": 2522, "hipify_result": 2523, "project_directory": 2524, "output_directory": 2525, "header_include_dirs": 2526, "show_detailed": 2527, "is_pytorch_extension": 2528, "hipify_extra_files_only": 2529, "hipified_sources": 2530, "s_abs": 2531, "sour": 2532, "ce": 2533, "hipified_s_abs": 2534, "hipified_path": 2535, "cython": 2536, "compiler": 2537, "cythonize": 2538, "annotate": 2539, "infiles": 2540, "detokenizer": 2541, "output_processor": 2542, "single_step": 2543, "stop_checker": 2544, "scheduler": 2545, "block_manager": 2546, "sampler": 2547, "compiler_directives": 2548, "language_level": 2549, "infer_types": 2550, "build_cython": 2551, "inplace": 2552, "enum": 2553, "typeddict": 2554, "typevar": 2555, "pytest": 2556, "nn": 2557, "functional": 2558, "autoconfig": 2559, "batchencoding": 2560, "batchfeature": 2561, "auto_factory": 2562, "_baseautomodelclass": 2563, "tests": 2564, "tokenstextlogprobs": 2565, "tokenstextlogprobspromptlogprobs": 2566, "assets": 2567, "audioasset": 2568, "imageasset": 2569, "videoasset": 2570, "convertoption": 2571, "runneroption": 2572, "_get_and_verify_dtype": 2573, "connections": 2574, "global_http_connection": 2575, "distributed": 2576, "cleanup_dist_env_and_memory": 2577, "init_distributed_environment": 2578, "initialize_model_parallel": 2579, "explicitencoderdecoderprompt": 2580, "to_enc_dec_tuple_list": 2581, "zip_enc_dec_prompts": 2582, "init_logger": 2583, "maybe_model_redirect": 2584, "_test_dir": 2585, "_test_prompts": 2586, "_long_prompts": 2587, "_sys_msg": 2588, "system_messages": 2589, "sonnet3": 2590, "5_nov2024": 2591, "_m": 2592, "_promptmultimodalinput": 2593, "promptimageinput": 2594, "promptaudioinput": 2595, "ndarray": 2596, "omptvideoinput": 2597, "_read_prompts": 2598, "imageassetprompts": 2599, "stop_sign": 2600, "cherry_blossom": 2601, "imagetestassets": 2602, "convenience": 2603, "matches": 2604, "iterating": 2605, "through": 2606, "videoassetprompts": 2607, "baby_reading": 2608, "videotestassets": 2609, "audioassetprompts": 2610, "mary_had_lamb": 2611, "winning_call": 2612, "audiotestassets": 2613, "image_assets": 2614, "singleton": 2615, "instance": 2616, "video_assets": 2617, "audio_assets": 2618, "fixture": 2619, "autouse": 2620, "cleanup_vllm_use_v1": 2621, "monkeypatch": 2622, "oracle": 2623, "sets": 2624, "vllm_use_v1": 2625, "during": 2626, "invocation": 2627, "touch": 2628, "changes": 2629, "made": 2630, "cleaned": 2631, "every": 2632, "delete": 2633, "clean": 2634, "upon": 2635, "modifies": 2636, "setenv": 2637, "delenv": 2638, "run_with_both_engines": 2639, "twice": 2640, "use_v1": 2641, "param": 2642, "decorated": 2643, "skip_v1": 2644, "skip_v0": 2645, "node": 2646, "get_closest_marker": 2647, "init_test_http_connection": 2648, "pytest_asyncio": 2649, "event": 2650, "loop": 2651, "created": 2652, "anew": 2653, "reuse_client": 2654, "dist_init": 2655, "temp_file": 2656, "mkstemp": 2657, "world_size": 2658, "rank": 2659, "distributed_init_method": 2660, "local_rank": 2661, "nccl": 2662, "should_do_global_cleanup_after_test": 2663, "allow": 2664, "subdirectories": 2665, "cleanup": 2666, "overriding": 2667, "provide": 2668, "10x": 2669, "speedup": 2670, "unit": 2671, "skip_global_cleanup": 2672, "cleanup_fixture": 2673, "dynamo_reset": 2674, "_dynamo": 2675, "reset": 2676, "example_prompts": 2677, "example_system_message": 2678, "uld_do_global_cleanup_after_test": 2679, "decoderprompttype": 2680, "encoder": 2681, "decoder": 2682, "empty_str": 2683, "example_encoder_decoder_prompts": 2684, "wherein": 2685, "pair": 2686, "encoder_prompts": 2687, "custom_decoder_prompts": 2688, "empty_str_decoder_prompts": 2689, "none_decoder_prompts": 2690, 